doom.org
:DOC-CONFIG:
# Tangle by default to config.el, which is the most common case
#+PROPERTY: header-args:emacs-lisp :tangle config.el
# Just silent the output. Ref: https://orgmode.org/manual/Results-of-Evaluation.html
#+PROPERTY: header-args :mkdirp yes :comments no :results output silent
# Manually set auto tangle for this file
#+AUTO_TANGLE: t
#+STARTUP: fold
:END:

# To increase text size in generated html
# Ref: https://www.w3schools.com/cssref/pr_font_font-size.asp
# Ref: https://stackoverflow.com/questions/51415911/emacs-org-mode-how-to-choose-font-when-exporting-to-html
# +HTML_HEAD_EXTRA: <style>*{font-family: serif !important}</style>
# +HTML_HEAD_EXTRA: <style>*{font-size: medium !important}</style>
# +HTML_HEAD_EXTRA: <style>*{font-family: 'Iosevka Aile Web', sans-serif; font-weight: 300; font-size: 1.3rem;}</style>

# Ref: https://olmon.gitlab.io/org-themes/
# +SETUPFILE: ../thirdp/org-themes/src/white_clean/white_clean.theme

# These default from org-html-themes
#+SETUPFILE: ../thirdp/org-html-themes/org/theme-readtheorg-local.setup
# +SETUPFILE: ../thirdp/org-html-themes/org/theme-bigblow-local.setup
# Then copy the "src" folder from the org-html-themes folder into
# the same folder as the file you want to export
# cp -R ../thridp/org-html-themes/src bo/
#+EXPORT_FILE_NAME: bo/doom
# the exported filename will be bo/doom.html, bo/doom.tex or bo/doom.pdf

#+title: Dot Doom Emacs
#+author: Totok Sulistiomono
#+email: s.totok@gmail.com
#       #+OPTIONS: num:nil

This is my Doom Emacs configuration, originally forked from [[https://github.com/zzamboni/dot-doom][zzamboni/dot-doom.git]].

* Table of Contents :TOC_3:noexport:
- [[#doom-config-files][Doom Config Files]]
  - [[#config-file-headers][Config file headers]]
    - [[#header-for-initel][Header for =init.el=]]
    - [[#header-for-packagesel][Header for =packages.el=]]
    - [[#header-for-configel][Header for =config.el=]]
  - [[#customized-variables][Customized variables]]
- [[#doom-modules][Doom Modules]]
  - [[#modules][Modules]]
  - [[#disabling-packages][Disabling Packages]]
  - [[#need-to-have-packages][Need to Have Packages]]
- [[#general-configuration][General Configuration]]
  - [[#doom-local-leader-key][Doom Local Leader Key]]
  - [[#personal-info-and-gpg][Personal Info and GPG]]
  - [[#better-defaults][Better Defaults]]
  - [[#mac-modifiers][Mac Modifiers]]
  - [[#frame-title][Frame Title]]
  - [[#persist-frame-geometry][Persist Frame Geometry]]
  - [[#scratch-buffer][Scratch Buffer]]
    - [[#doom-scratch-buffer][Doom Scratch Buffer]]
    - [[#emacs-scratch-buffer][Emacs Scratch Buffer]]
  - [[#dashboard][Dashboard]]
  - [[#fonts][Fonts]]
  - [[#themes][Themes]]
  - [[#line-settings][Line settings]]
  - [[#pulsing-cursor][Pulsing Cursor]]
  - [[#rainbow-mode][Rainbow mode]]
    - [[#tools-rgb][=:tools rgb=]]
    - [[#manual-package-installation][Manual package installation]]
  - [[#rainbow-delimiters][Rainbow delimiters]]
  - [[#modeline][Modeline]]
    - [[#doom-modeline][doom-modeline]]
    - [[#which-function-mode][which-function-mode]]
    - [[#show-current-time][Show current time]]
  - [[#indent-guide][Indent guide]]
  - [[#shrink-whitespace][Shrink Whitespace]]
  - [[#registers][Registers]]
  - [[#key-bindings][Key bindings]]
    - [[#emulating-vis--key][Emulating vi's =%= key]]
- [[#tree-sitter][Tree-Sitter]]
  - [[#use-emacs-tree-sitter-for-hightlighting-in-doom-emacs][Use Emacs-Tree-Sitter for Hightlighting in Doom Emacs]]
- [[#evil][Evil]]
  - [[#general][General]]
  - [[#move-around][Move Around]]
    - [[#vertical-movement][Vertical Movement]]
    - [[#horizontal-movement][Horizontal Movement]]
    - [[#arbitrary-movement][Arbitrary Movement]]
  - [[#evil-mc][evil-mc]]
    - [[#incompatibility][Incompatibility]]
    - [[#hydra][Hydra]]
    - [[#working-with-smartparens][Working With Smartparens]]
  - [[#evil-escape][Evil Escape]]
  - [[#evil-motion-trainer][Evil Motion Trainer]]
  - [[#evil-visualstar][Evil Visualstar]]
  - [[#evil-exchange][Evil Exchange]]
  - [[#reference][Reference]]
- [[#abo-abo][abo-abo]]
  - [[#avy][avy]]
    - [[#avy-goto-line][avy-goto-line]]
    - [[#avy-can-do-anything][Avy Can Do Anything]]
    - [[#avy-actions-are-awesome][Avy Actions are Awesome!]]
  - [[#ivy][ivy]]
- [[#vertico--co][Vertico & Co]]
  - [[#project-wide-search-and-replace][Project-wide Search and Replace]]
- [[#org][Org]]
  - [[#general-org-configuration][General Org Configuration]]
  - [[#org-visual-settings][Org visual settings]]
  - [[#org-roam][Org Roam]]
    - [[#configuration][Configuration]]
    - [[#front-end][Front end]]
  - [[#exporting-a-curriculum-vitae][Exporting a Curriculum Vitae]]
  - [[#revealjs-presentations][Reveal.js presentations]]
  - [[#org-tree-slide][Org-tree-slide]]
  - [[#publishing-project][Publishing Project]]
  - [[#anki-decks-with-orgmode][Anki Decks with Orgmode]]
  - [[#the-orgtbl-minor-mode][The Orgtbl Minor mode]]
  - [[#tableel][Table.el]]
- [[#coding][Coding]]
  - [[#tangle-on-save][Tangle-on-save]]
- [[#template][Template]]
  - [[#file-template][File Template]]
- [[#cc][C/C++]]
- [[#cscope][Cscope]]
- [[#python][Python]]
  - [[#pipenv][pipenv]]
    - [[#python-launcher][Python Launcher]]
    - [[#python-user-base-directory][Python User Base Directory]]
    - [[#install][Install]]
    - [[#bashrc][.bashrc]]
    - [[#windows-environment-variable][windows environment variable]]
    - [[#createactivate-virtual-environment][Create/Activate virtual environment]]
- [[#magit][Magit]]
  - [[#magit-and-gerrit][Magit and Gerrit]]
  - [[#blame][Blame]]
  - [[#blamer][Blamer]]
- [[#project-management][Project Management]]
  - [[#projectel][project.el]]
    - [[#overriding-the-projectel-project-directory][Overriding the project.el project directory]]
  - [[#projectile][Projectile]]
    - [[#customization][Customization]]
    - [[#keeping-projectiles-cache-tidy][Keeping Projectile's Cache Tidy]]
  - [[#bookmark-in-project][Bookmark in Project]]
- [[#remote-file-editing][Remote File Editing]]
  - [[#using-local-emacs-from-a-remote-host][Using Local Emacs from a Remote Host]]
  - [[#tramp][Tramp]]
- [[#plantuml][Plantuml]]
  - [[#need-dot-utility-from-graphviz-package][Need =dot= utility from =graphviz= package]]
  - [[#plantuml-mode][=plantuml-mode=]]
  - [[#if-youd-like-to-edit-dot-file-directly][If you'd like to edit =dot file= directly]]
- [[#treemacs][Treemacs]]
  - [[#treemacs-projectile][treemacs-projectile]]
  - [[#lsp-treemacs][=lsp-treemacs=]]
- [[#language-server-protocol][Language Server Protocol]]
  - [[#lsp][LSP]]
    - [[#configuration-1][Configuration]]
    - [[#keybindings][Keybindings]]
- [[#company][Company]]
- [[#spell-checker][Spell Checker]]
- [[#calendar-and-world-clock][Calendar and World Clock]]
  - [[#calendar][Calendar]]
  - [[#localized-holidays][Localized Holidays]]
  - [[#world-clock][World Clock]]
- [[#other-modes][Other Modes]]
  - [[#qml-qt-declarative][QML (QT Declarative)]]
  - [[#csv-mode][CSV mode]]
  - [[#json-mode][JSON mode]]
  - [[#cmake-mode][CMake mode]]
  - [[#makefile-mode][Makefile mode]]
- [[#tools][Tools]]
  - [[#docker][docker]]
  - [[#copy-full-path-of-current-buffer][Copy full path of current buffer]]
  - [[#insert-date-at-cursor][Insert date at cursor]]
  - [[#show-ascii-table][Show ascii table]]
  - [[#arrayify][Arrayify]]
  - [[#dwim-shell-command][dwim-shell-command]]
- [[#how-to][How To]]
  - [[#directory-editor-with-dired][Directory Editor with Dired]]
  - [[#expand-region][Expand region]]
    - [[#key-binding][Key binding]]
  - [[#map-unmap-keybinding][Map Unmap keybinding]]
  - [[#what-is-my-xxx][What is my xxx]]
- [[#references][References]]
  - [[#general-emacs][General Emacs]]
  - [[#doom-emacs][Doom Emacs]]
  - [[#org-mode][Org-mode]]
  - [[#keybindings-1][Keybindings]]
  - [[#pipenv-1][=pipenv=]]
  - [[#latex-and-tikz][Latex and Tikz]]
  - [[#everything-else][Everything Else]]
- [[#practice][Practice]]
  - [[#delete-n-lines-including-current-line][Delete n lines including current line]]
    - [[#with-avy][With avy]]
    - [[#with-evilmotion][With evilmotion]]
  - [[#delete-n-block-of-chars][Delete n block of chars]]
    - [[#with-avy-1][With avy]]
    - [[#with-evil-snipe][With evil-snipe]]
  - [[#uncommenting][(Un)commenting]]
    - [[#select-comment][Select comment]]
  - [[#evil-multiedit][Evil-multiedit]]
  - [[#narrowing][Narrowing]]
  - [[#copy-and-comment-lines][Copy and comment lines]]
  - [[#search-with-ripgrep][Search with ripgrep]]
    - [[#live-project-search-from-the-project-root-using-ripgrep][Live project search from the project root using ripgrep]]
    - [[#grep-for-a-string-in-the-current-directory-using-ripgrep][Grep for a string in the current directory using ripgrep]]
    - [[#search-the-current-project-with-ripgrep][Search the current project with ripgrep]]
  - [[#break-a-long-line-into-shorther-lines][Break a long line into shorther lines]]
  - [[#calculator][Calculator]]
    - [[#keybinding][Keybinding]]
    - [[#trail-commands][Trail Commands]]
    - [[#digit-grouping][Digit Grouping]]
    - [[#calc-mode-epiphany][Calc-Mode Epiphany]]
    - [[#convert-decimalhexadecimalbinary][Convert Decimal/Hexadecimal/Binary]]
    - [[#binary-number-operation][Binary Number Operation]]
    - [[#hms][HMS]]
  - [[#macros][Macros]]
    - [[#exercise-1][Exercise 1]]
    - [[#exercise-2][Exercise 2]]

* Doom Config Files

Doom Emacs uses three config files which are generated from this Org file (=doom.org=):

- =init.el= defines which of the existing Doom [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#modules][modules]] are loaded. A Doom module is
  a bundle of packages, configuration and commands, organized into a unit that can
  be toggled easily from this file.
- =packages.el= defines which [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#package-management][packages]] should be installed, beyond those that are
  installed and loaded as part of the enabled modules.
- =config.el= contains all [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#configuring-doom][custom configuration]] and code.

There are other files that can be loaded, but theses are the main ones. The load
order of different files is [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#load-order][defined depending on the type of session]] being started.

** Config file headers

We start by simply defining the standard headers used by the three files. These headers
come from the initial files generated by =doom install=, and contain either some Emacs-LISP
relevant indicators like =lexical-binding=, or instructions about the contents of the file.

*** Header for =init.el=

#+begin_src emacs-lisp :tangle init.el
;;; $DOOMDIR/init.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://gitlab.com/zzamboni/dot-doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).
#+end_src

