doom.org
** Modules

This code is written to the =init.el= to select which modules to load.
Reference:
- Online reference: [[https://github.com/doomemacs/doomemacs/blob/master/templates/init.example.el][Doom emacs blob init.example.el]].
- Offline reference: "SPC f e example RET"

#+begin_src emacs-lisp :tangle init.el
(doom!
 :input
 ;;chinese
 ;;japanese
 ;;layout              ; auie,ctsrnm is the superior home row

 :completion
 ;(company +childframe) ; the ultimate code completion backend
 company ; the ultimate code completion backend
 ;;helm                ; the *other* search engine for love and life
 ;;ido                 ; the other *other* search engine...
 ;(ivy +prescient +childframe
 ;(ivy +prescient
 ;     -fuzzy +icons)   ; a search engine for love and life
 vertico               ; the search engine for the future

 :ui
 ;;deft                ; notational velocity for Emacs
 doom                  ; what makes DOOM look the way it does
 doom-dashboard        ; a nifty splash screen for Emacs
 ;;doom-quit           ; DOOM quit-message prompts when you quit Emacs
 ;;(emoji +unicode)    ;
 ;;fill-column         ; a `fill-column' indicator
 ;;hl-todo               ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
 hydra
 indent-guides         ; highlighted indent columns
 ;;ligatures           ; ligatures and symbols to make your code pretty again
 ;;minimap             ; show a map of the code on the side
 modeline              ; snazzy, Atom-inspired modeline, plus API
 nav-flash             ; blink cursor line after big motions
 ;;neotree             ; a project drawer, like NERDTree for vim
 ophints               ; highlight the region an operation acts on (previously evil-goggles)
 (popup
  ;;+all               ; ensure all temporary/special buffers (name started with space or asterix) treated as popups
  +defaults)           ; enable reasonable default popup rues for a variaty of buffers
 ;;tabs                ; a tab bar for Emacs
 (treemacs             ; a project drawer, like neotree but cooler
  +lsp                 ; enable lsp-treemacs integration and add shortcuts for common commands
  )
 ;;unicode             ; extended unicode support for various languages
 ;;vc-gutter           ; vcs diff in the fringe
 ;;vi-tilde-fringe       ; fringe tildes to mark beyond EOB
 ;;window-select         ; visually switch windows
 workspaces            ; tab emulation, persistence & separate workspaces
 ;;zen                   ; distraction-free coding or writing

 :editor
 (evil +everywhere)    ; come to the dark side, we have cookies
 file-templates        ; auto-snippets for empty files
 fold                  ; (nigh) universal code folding
 ;;(format +onsave)    ; automated prettiness
 ;;god                 ; run Emacs commands without modifier keys
 ;;lispy               ; vim for lisp, for people who don't like vim
 multiple-cursors      ; editing in many places at once
 ;;objed               ; text object editing for the innocent. But this is incompatible with :editor evil.
 ;;parinfer            ; turn lisp into python, sort of
 ;;rotate-text         ; cycle region at point between text candidates
 snippets              ; my elves. They type so I don't have to
 ;;word-wrap           ; soft wrapping with language-aware indent

 :emacs
 dired                 ; making dired pretty [functional]
 electric              ; smarter, keyword-based electric-indent
 ;;ibuffer             ; interactive buffer management
 undo                  ; persistent, smarter undo for your inevitable mistakes
 vc                    ; version-control and Emacs, sitting in a tree

 :term
 eshell                ; the elisp shell that works everywhere
 ;;shell               ; simple shell REPL for Emacs
 ;;term                ; basic terminal emulator for Emacs
 ;;vterm               ; the best terminal emulation in Emacs

 :checkers
 ;;(syntax +childframe)  ; tasing you for every semicolon you forget
 ;;syntax                ; tasing you for every semicolon you forget
                       ; 'syntax' activates flycheck-mode automatically
 ;;spell                 ; tasing you for misspelling mispelling
 ;;grammar             ; tasing grammar mistake every you make

 :tools
 ;;ansible
 ;;debugger              ; FIXME stepping through code, to help you add bugs
 ;;direnv
 docker
 ;;editorconfig        ; let someone else argue about tabs vs spaces
 ;;ein                 ; tame Jupyter notebooks with emacs
 (eval +overlay)       ; run code, run (also, repls)
 ;;gist                ; interacting with github gists
 lookup                ; navigate your code and its documentation
 (lsp
   +peek               ; use lsp-ui-peek for definitions and references
   )
 magit                 ; a git porcelain for Emacs
 ;;(magit +forge)        ; a git porcelain for Emacs
 ;;make                ; run make tasks from Emacs
 ;;pass                  ; password manager for nerds
 ;;pdf                 ; pdf enhancements
 ;;prodigy             ; FIXME managing external services & code builders
 rgb                   ; creating color strings
 ;;taskrunner          ; taskrunner for all your projects
 ;;terraform           ; infrastructure as code
 ;;tmux                ; an API for interacting with tmux
 tree-sitter           ; syntax and parsing, sitting in a tree...
 ;;upload              ; map local to remote projects via ssh/ftp

 :os
 (:if IS-MAC macos)    ; improve compatibility with macOS
 ;;tty                 ; improve the terminal Emacs experience

 :lang
 ;;agda                ; types of types of types of types...
 ;;beancount           ; mind the GAAP
 (cc +lsp +tree-sitter)          ; C/C++/Obj-C madness
 ;;clojure             ; java with a lisp
 common-lisp           ; if you've seen one lisp, you've seen them all
 ;;coq                 ; proofs-as-programs
 ;;crystal             ; ruby at the speed of c
 ;;csharp              ; unity, .NET, and mono shenanigans
 data                  ; config/data formats (csv-mode, nxml-mode)
 ;;(dart +flutter)     ; paint ui and not much else
 ;;elixir              ; erlang done right
 ;;elm                 ; care for a cup of TEA?
 emacs-lisp            ; drown in parentheses
 ;;erlang              ; an elegant language for a more civilized age
 ;;(ess +lsp)            ; emacs speaks statistics
 ;;factor
 ;;faust               ; dsp, but you get to keep your soul
 ;;fsharp              ; ML stands for Microsoft's Language
 ;;fstar               ; (dependent) types and (monadic) effects and Z3
 ;;gdscript            ; the language you waited for
 ;;(go +lsp)             ; the hipster dialect
 ;;(haskell +dante)    ; a language that's lazier than I am
 ;;hy                  ; readability of scheme w/ speed of python
 ;;idris               ; a language you can depend on
 (json +tree-sitter)                    ; At least it ain't XML
 ;;(java +meghanada)   ; the poster child for carpal tunnel syndrome
 ;;javascript          ; all(hope(abandon(ye(who(enter(here))))))
 ;;julia               ; a better, faster MATLAB
 ;;kotlin              ; a better, slicker Java(Script)
 (latex +latexmk)      ; writing papers in Emacs has never been so fun
 ;;lean
 ;;ledger              ; an accounting system in Emacs
 ;;lua                   ; one-based indices? one-based indices
 ;;markdown              ; writing docs for people to ignore
 ;;nim                 ; python + lisp at the speed of c
 ;;nix                 ; I hereby declare "nix geht mehr!"
 ;;ocaml               ; an objective camel
 (org                  ; organize your plain life in plain text
  +present             ; presentation, include reveal.js
  ;+roam2               ; Need sqlite3: $ sudo apt install sqlite3 libsqlite3-dev
                       ;               $ brew install sqlite3
  ;+pretty              ; Pretty unicode symbols for bullets and priorities. Keep
                       ; in mind: this can be expensive. If org becomes too slow,
                       ; it'd be wise to disable this flag.
  )
 ;;php                 ; perl's insecure younger brother
 plantuml              ; diagrams for confusing people more
 ;;purescript          ; javascript, but functional
 (python               ; yeah, monty python :D
  +lsp                 ; you gonna need this
  +pyright             ; use pyright lsp server instead of mspyls or pyls
  ;;+pyenv               ; python virtual environment support via pyenv
  +tree-sitter
  )
 qt                    ; the 'cutest' gui framework ever (qml-mode, qt-pro-mode)
 ;;racket                ; a DSL for DSLs
 ;;raku                ; the artist formerly known as perl6
 ;;rest                ; Emacs as a REST client
 ;;rst                   ; ReST in peace
 ;;(ruby +rails)       ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
 ;;rust                ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
 ;;scala               ; java, but good
 ;;scheme              ; a fully conniving family of lisps
 ;(sh +lsp)             ; she sells {ba,z,fi}sh shells on the C xor
 sh                    ; she sells {ba,z,fi}sh shells on the C xor
 ;;sml
 ;;solidity            ; do you need a blockchain? No.
 ;;swift               ; who asked for emoji variables?
 ;;terra               ; Earth and Moon in alignment for performance.
 ;;web                 ; the tubes
 ;;(yaml +lsp)           ; JSON, but readable
 ;;zig                 ; C, but simpler

 :email
 ;;(mu4e +gmail)
 ;;notmuch
 ;;(wanderlust +gmail)

 :app
 ;;calendar
 ;;emms
 ;;everywhere          ; *leave* Emacs!? You must be joking
 ;;irc                   ; how neckbeards socialize
 ;;(rss +org)          ; emacs as an RSS reader
 ;;twitter             ; twitter client https://twitter.com/vnought

 :config
 ;;literate
 (default +bindings +smartparens))
#+end_src

** Disabling Packages

#+begin_src emacs-lisp :tangle packages.el
(package! rtags :disable t)
(package! helm-rtags :disable t)
(package! helm-lsp :disable t)
(package! ivy-rtags :disable t)
(package! ccls :disable t)
(package! conda :disable t)
(package! anaconda-mode :disable t)
(package! company-anaconda :disable t)
(package! ocamlformat :disable t)
(package! lsp-python-ms :disable t)
(package! lsp-ivy :disable t)
(package! evil-escape :disable t)
(package! forge :disable t)
(package! magit-gitflow :disable t)
(package! magit-todos :disable t)
(package! github-review :disable t)
(package! github-browse-file :disable t)
(package! eglot :disable t)
#+end_src

** Need to Have Packages

Will install these packages later:
- [[https://xenodium.com/emacs-org-block-completion-on-melpa/][Emacs org block completion on melpa]]
- [[https://www.reddit.com/r/emacs/comments/ntnhkc/how_i_jump_around_emacs_with_betterjumper/][How I jump around emacs with better jumper]]
- [[https://philjackson.github.io/emacs/widescreen/2021/06/06/wide-screen-emacs/][Widescreen Emacs and Vertical Splits]]

* General Configuration

** Doom Local Leader Key

=M-x= is one too many keystroke. Let's change it to =','=, however, =','= already being
used by evil-snipe. Hence, need to resolve the conflict.

Ref: [[https://github.com/hlissner/doom-emacs/issues/4242][Setting doom local leader key to "," conflicts with evil-snipe]].

#+begin_src emacs-lisp
(setq-default evil-snipe-override-evil-repeat-keys nil
              doom-localleader-key ","
              doom-localleader-alt-key "M-,")
#+end_src

** Personal Info and GPG

This is used by GPG and other things.

#+begin_src emacs-lisp
(setq user-full-name "Totok Sulistiomono"
      user-mail-address "s.totok@gmail.com")
#+end_src

Speaking of GPG, I use =~/.authsource.gpg= instead of the default in =~/.emacs.d=.
Reason: I don't want to accidentally purge this file (e.g. =rm -rf ~/.emacs.d=).

#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo.gpg")
      auth-source-cache-expiry nil)      ; default is 7200 (2h)
#+end_src

