packages.el

(package! rtags :disable t)
(package! helm-rtags :disable t)
(package! helm-lsp :disable t)
(package! ivy-rtags :disable t)
(package! ccls :disable t)
(package! conda :disable t)
(package! anaconda-mode :disable t)
(package! company-anaconda :disable t)
(package! lsp-python-ms :disable t)
(package! lsp-ivy :disable t)
(package! evil-escape :disable t)
(package! forge :disable t)
(package! magit-gitflow :disable t)
(package! magit-todos :disable t)
(package! github-review :disable t)
(package! eglot :disable t)
