doom.org
** Better Defaults

Don't load xresources, it messes with our themes.

#+begin_src emacs-lisp
(setq-default inhibit-x-resources t)
#+end_src

Change the default encoding to UTF-8

#+begin_src emacs-lisp
(set-language-environment 'utf-8)
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq utf-translate-cjk-mode nil
      locale-coding-system 'utf-8
      default-file-name-coding-system 'utf-8
      default-buffer-file-coding-system 'utf-8
      coding-system-for-write 'utf-8)
#+end_src

Do not create lockfiles for files being edited

#+begin_src emacs-lisp
(setq create-lockfiles nil)
#+end_src

Do not need emacs backup file lah ...

#+begin_src emacs-lisp
(setq auto-save-default nil             ; don't create #autosave# files
      make-backup-files nil             ; don't create backup~ files
      create-lockfiles  nil)
#+end_src

Disable exit confirmation.

#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)
#+end_src

Other default preferences

#+begin_src emacs-lisp
(set-fringe-mode '(0 . 0))            ; disable fringe, dun need it (no line wrap, etc)
(fset 'yes-or-no-p 'y-or-n-p)         ; replace yes/no prompts with y/n
(setq-default
 indent-tabs-mode nil                 ; use spaces (not tabs) for indenting
 truncate-lines t                     ; turn on truncating long lines
 require-final-newline t              ; always add a final newline
 delete-by-moving-to-trash nil        ; no need to go to OS's trash folder
 cursor-in-non-selected-windows nil   ; hide cursor in inactive windows
 select-enable-clipboard t            ; merge system's and emacs's clipboard
 ;; disable, looks like Doom has it by default?
 split-height-threshold 0             ; i only want vertical window splitting
 split-width-threshold nil            ; and dunwan horizontal window splitting
 ;; vi like scrolling
 scroll-step 1                        ; scroll just goes down 1 line even it hits the bottom
 scroll-margin 3                      ; 3 lines margin
 ;;
 ;; Build-In VC Package
 vc-follow-symlinks t                 ; don't ask for confirmation for opening symlinked file
 ;; Ref https://magit.vc/manual/magit/Performance.html
 ;; I don't use VC in addition to Magit, so disable it to keep it from performing
 ;; unnecessary work (see also another option just below)
 ;; vc-handled-backends nil ; disable due to causing vcs segment gone in doom-modeline
 ;; You can also disable its use for Git but keep using it when using another version
 ;; control system:
 ;; vc-handled-backends (delq 'Git vc-handled-backends)
 ;;
 ;; always just just left-to-right text
 bidi-display-reordering nil           ; makes emacs a bit faster for very long lines
 dabbrev-case-replace nil              ; make sure case is preserved when expanding
 ;;
 ;; This section is related to window
 ;; For more info: https://www.masteringemacs.org/article/demystifying-emacs-window-manager
 ;; #1: If wwitching buffers manually with C-x b fails with error, so I want it to open somewhere
 switch-to-buffer-in-dedicated-window 'pop
 ;; #2: Treat manual buffer switching the same as programmatic switching
 switch-to-buffer-obey-display-actions t ; requires emacs 27+
 ;; Controlling Buffer and Window Display
 ;; If you want to control where a buffer or window must appear, you must customize
 ;; display-buffer-alist
 )
#+end_src

Let's use =hippie-expand= instead of =dabbrev= as default. Ref: [[https://www.masteringemacs.org/article/text-expansion-hippie-expand][Text Expansion with Hippie Expand]]:
#+begin_src emacs-lisp
(global-set-key [remap dabbrev-expand] 'hippie-expand)
#+end_src

Also, let's enable local variales and eva:
#+begin_src emacs-lisp
(after! org
  (setq-default enable-local-variables t
                enable-local-eval t))
#+end_src

** Mac Modifiers

Change Mac modifiers to my liking.

#+begin_src emacs-lisp
(cond (IS-MAC
 ;; 1) Mac build-in Keyboard & Mouse preference:
 ;;    - Swapt [CapsLock] and [Control]
 ;;
 ;; 2) KeyRemap4MacBook:
 ;;    - Map [Option_R] to [Control_R] (only in Emacs, Terminal, X11)
 ;;    Note: This KeyRemap4MacBook no need anymore because I can remap
 ;;          option to control using mac-option-modifier below ...
 ;;
 ;; 3) Then below:
 ;;
 ;;    See https://emacsformacosx.com/tips
 ;;    Here's variables controlling the modifier keys:
 ;;
 ;;    - ns-alternate-modifier
 ;;    - ns-command-modifier
 ;;    - ns-control-modifier
 ;;    - ns-function-modifier
 ;;    - ns-option-modifier (just a different name for ns-alternate-modifier)
 ;;    - ns-right-alternate-modifier
 ;;    - ns-right-command-modifier
 ;;    - ns-right-control-modifier
 ;;    - ns-right-option-modifier
 ;;
 ;;    Each variable can be set to 'control, 'meta, 'alt, 'super, or 'hyper.
 ;;
 ;;    In addition ns-alternative-modifier (and ns-option-modifier) can be set to 'none,
 ;;    which lets it get interpreted by the OS so it can be used to input special
 ;;    characters.
 ;;
 ;;    The ns-right-* variables are set to 'left by default which makes them the same as
 ;;    their left counterpart.
 (setq mac-command-modifier      'meta      ; [Command] behaves like [Meta]
       mac-option-modifier       'control   ; [Option]  behaves like [Control]
       mac-right-option-modifier 'control)))
#+end_src

** Frame Title

Show full path of current buffer. See format specifier [[https://www.gnu.org/software/emacs/manual/html_node/elisp/_0025_002dConstructs.html#g_t_0025_002dConstructs][%-Constructs]].

#+begin_src emacs-lisp
(setq-default frame-title-format (list (system-name) ":" "%f"))
#+end_src

** Persist Frame Geometry

Reference: [[https://github.com/hlissner/doom-emacs/blob/develop/docs/api.org#persist-emacs-initial-frame-position-dimensions-andor-full-screen-state-across-sessions][Persist Emacs Frame]].

#+begin_src emacs-lisp
;; add to config.el
(when-let (dims (doom-store-get 'last-frame-size))
  (cl-destructuring-bind ((left . top) width height fullscreen) dims
    (setq initial-frame-alist
          (append initial-frame-alist
                  `((left . ,left)
                    (top . ,top)
                    (width . ,width)
                    (height . ,height)
                    (fullscreen . ,fullscreen))))))

(defun save-frame-dimensions ()
  (doom-store-put 'last-frame-size
                  (list (frame-position)
                        (frame-width)
                        (frame-height)
                        (frame-parameter nil 'fullscreen))))

(add-hook 'kill-emacs-hook #'save-frame-dimensions)
#+end_src

** Scratch Buffer
*** Doom Scratch Buffer
Doom has persistance scratch buffer named =doom:scratch= with:
- =M-x doom/switch-to-scratch-buffer (SPC b X)=, or
- =M-x doom/open-scratch-buffer (SPC x)=

#+begin_src emacs-lisp
(setq-default doom-scratch-dir (format "%s/private" (getenv "DOOMDIR"))
              doom-scratch-initial-major-mode 'text-mode)
#+end_src

*** Emacs Scratch Buffer
This is for default emacs scratch buffer named =scratch=. Available on MELPA.
Ref: [[https://umarahmad.xyz/blog/quick-scratch-buffers/][Quick persistent scratch buffer]], Github: [[https://github.com/Fanael/persistent-scratch/][Fanael/persistent-scratch]].

#+begin_src emacs-lisp :tangle no
(package! persistent-scratch
  :recipe (:branch "master"))
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! persistent-scratch
 :init
 :config
 ;; Directory to save old versions of scratch buffer saves to
 (setq persistent-scratch-backup-directory (format "%s/private/persist-scratch" (getenv "DOOMDIR")))
 ;; Enable both autosave and restore the last saved data on emacs start
 (persistent-scratch-setup-default)
 ;; See https://umarahmad.xyz/blog/quick-scratch-buffers/
 ;; (setq persistent-scratch-save-file (concat CACHE-DIR ".persistent-scratch"))
 (setq persistent-scratch-save-file (concat persistent-scratch-backup-directory "/persistent-scratch"))
 ;; (persistent-scratch-restore)
 ;; (persistent-scratch-setup-default)
 (persistent-scratch-autosave-mode)
 (defun persistent-scratch-buffer-identifier()
     (string-match "^*scratch:" (buffer-name)))
 (defun persistent-scratch-get-scratches()
     (let ((scratch-buffers)
         (save-data
         (read
             (with-temp-buffer
             (let ((coding-system-for-read 'utf-8-unix))
                 (insert-file-contents persistent-scratch-save-file))
             (buffer-string)))))
     (dolist (saved-buffer save-data)
         (push (substring (aref saved-buffer 0) (length "*scratch:")) scratch-buffers))
     scratch-buffers))

 (defun persistent-scratch-restore-this(&optional file)
     (interactive)
     (let ((current-buf (buffer-name (current-buffer)))
         (save-data
         (read
             (with-temp-buffer
             (let ((coding-system-for-read 'utf-8-unix))
                 (insert-file-contents (or file persistent-scratch-save-file)))
             (buffer-string)))))
     (dolist (saved-buffer save-data)
         (when (string= current-buf (aref saved-buffer 0))
         (with-current-buffer (get-buffer-create (aref saved-buffer 0))
             (erase-buffer)
             (insert (aref saved-buffer 1))
             (funcall (or (aref saved-buffer 3) #'ignore))
             (let ((point-and-mark (aref saved-buffer 2)))
             (when point-and-mark
                 (goto-char (car point-and-mark))
                 (set-mark (cdr point-and-mark))))
             (let ((narrowing (aref saved-buffer 4)))
             (when narrowing
                 (narrow-to-region (car narrowing) (cdr narrowing))))
             ;; Handle version 2 fields if present.
             (when (>= (length saved-buffer) 6)
             (unless (aref saved-buffer 5)
                 (deactivate-mark))))))))

 (defun persistent-scratch-quick-open()
     (interactive)
     (let* ((scratch-buffers (persistent-scratch-get-scratches))
         (chosen-scratch (concat "*scratch:"
                                 (completing-read
                                 "Choose a scratch: "
                                 scratch-buffers nil nil nil nil
                                 (random-alnum 4))))
         (buffer-exists-p (get-buffer chosen-scratch)))
     (pop-to-buffer chosen-scratch)
     (unless buffer-exists-p
         (persistent-scratch-restore-this))
     (persistent-scratch-mode)))
 (setq persistent-scratch-scratch-buffer-p-function 'persistent-scratch-buffer-identifier)
)
#+end_src
** Dashboard
