doom.org
** Fonts

To install custom fonts in linux:
#+begin_src bash
$ cd ~/Downloads
$ wget https://github.com/be5invis/Iosevka/releases/download/v27.3.4/super-ttc-iosevka-ss04-27.3.4.zip
$ unzip super-ttc-iosevka-ss04-17.1.0.zip
  it will extract to a font file: iosevka-ss04.ttc
$ sudo mkdir /usr/local/share/fonts/iosevka-font
$ sudo mv iosevka-ss04.ttc /usr/local/share/fonts/iosevka-font/
$ sudo chown root:staff /usr/local/share/fonts/iosevka-font/iosevka-ss04.ttc
$ sudo fc-cache -fv
#+end_src

To list available fonts in linux:
#+begin_src bash
$ fc-list | grep InputSans
#+end_src

To list fonts that emacs can see:
#+begin_example
M-x menu-set-font
#+end_example

My favourite fonts:

+ [[https://input.fontbureau.com][Input]].
+ [[https://fonts.google.com/specimen/Roboto+Mono][Roboto Mono]].
+ [[https://typeof.net/Iosevka/][Iosevka]] and [[https://github.com/be5invis/Iosevka][Installation Guide]]. Also [[https://github.com/be5invis/Iosevka][Iosevka on GitHub]].
  - On MacOS
    #+begin_example
    $ brew tap homebrew/cask-fonts
    $ brew install --cask font-iosevka
    $ brew install --cask font-iosevka-ss04
    #+end_example

Settings related to fonts:

+ 'doom-font' -- standard monospace font that is used for most things.
+ 'doom-variable-pitch-font' -- variable font which is useful in some plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.

#+begin_src emacs-lisp
(cond
 (IS-SIDESTEP
  (setq doom-font                (font-spec :family "menlo" :size 12)
        doom-variable-pitch-font (font-spec :family "menlo" :size 12)
        doom-big-font            (font-spec :family "menlo" :size 18)))
 ((or IS-IGL6301W IS-OMICRON)
  (setq doom-font                (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-variable-pitch-font (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-big-font            (font-spec :family "Iosevka Fixed SS04 MdEx" :size 18)))
 (IS-COVID
  (setq doom-font                (font-spec :family "Input Mono Condensed" :size 12)
        doom-variable-pitch-font (font-spec :family "Input Mono Condensed" :size 12)
        doom-big-font            (font-spec :family "Input Mono Condensed" :size 18)))
 (IS-IGD1943U
  (setq doom-font                (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-variable-pitch-font (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-big-font            (font-spec :family "Iosevka Fixed SS04 MdEx" :size 18)))
 (IS-IGL7568W
  (setq doom-font                (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-variable-pitch-font (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-big-font            (font-spec :family "Iosevka Fixed SS04 MdEx" :size 18)))
 (IS-LOGE
  (setq doom-font                (font-spec :family "Input Mono Narrow" :size 12)
        doom-variable-pitch-font (font-spec :family "Input Mono Narrow" :size 12)
        doom-big-font            (font-spec :family "Input Mono Narrow" :size 18)))
 (IS-IGD0464U
  (setq doom-font                (font-spec :family "Input Mono Condensed" :size 12)
        doom-variable-pitch-font (font-spec :family "Input Mono Condensed" :size 12)
        doom-big-font            (font-spec :family "Input Mono Condensed" :size 18)))
 (IS-ERIS
  (setq doom-font                (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-variable-pitch-font (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-big-font            (font-spec :family "Iosevka Fixed SS04 MdEx" :size 18)))
 (t
  (setq doom-font                (font-spec :family "monospace" :size 12)
        doom-variable-pitch-font (font-spec :family "monospace" :size 12)
        doom-big-font            (font-spec :family "monospace" :size 18))))
#+end_src

Check this reference:

- [[https://www.dschapman.com/notes/mix-monospace-and-variable-fonts-in-doom-emacs][How to mix monospace and viariable width fonts]]
- [[https://emacs.stackexchange.com/questions/62987/cannot-set-correct-size-for-variable-pitch-font-in-doom-emacs][Cannot set correct size for variable pitch font in Doom Emacs]].

Allow mixed fonts in a buffer. This is particularly useful for Org mode,
so I can mix source and prose blocks in the same document.

#+begin_src emacs-lisp :tangle no
(add-hook! 'org-mode-hook #'mixed-pitch-mode)
(setq mixed-pitch-variable-pitch-cursor t)
#+end_src

** Themes

I customize existing doom-themes to my liking:

- Copy one of doom-themese to =${DOOMDIR}/themes=.
- Change the filename.
- Change =def-doom-theme= name to avoid conflict with the existing.
- That's it. Customize other settings as you please.

#+begin_src emacs-lisp
(when (modulep! :ui doom)
  (setq doom-themes-enable-bold t      ; if nil, bold i universally disabled
      doom-themes-enable-italic t      ; if nil, italics is universally disabled
  )
  ;; select theme
  (cond
   ((or IS-OMICRON IS-IGD0464U)
    (setq doom-theme 'ttk-doom-solarized-light))
   (IS-IGL6301W
    (setq doom-theme 'ttk-doom-one-light))
   (IS-IGL7568W
    (setq doom-theme 'ttk-doom-one-light))
   (IS-IGD1943U
    (setq doom-theme 'ttk-doom-one-light))
   (IS-COVID
    (setq doom-theme 'ttk-doom-solarized-light))
   (IS-DELTA
    (setq doom-theme 'ttk-doom-one-light))
   (IS-ERIS
    (setq doom-theme 'ttk-doom-one-light))
   (t
    (setq doom-theme 'ttk-doom-zenburn)))
  ;; corrects (and improves) org-mode's native fontification
  (doom-themes-org-config))
#+end_src

#+begin_src emacs-lisp
;; ref: https://github.com/bbatsov/solarized-emacs
;; if you are using emacs under X you might like the following setting which puts
;; the underline below the font bottomline instead of the baseline.
(if (display-graphic-p)
  (progn
   ;; in graphics mode
   (setq x-underline-at-descent-line t))
  ;; else in terminal
  ;; do nothing
  )
;; get the right time to set face of hl-line is a bit tricky
;; each theme has its own way to set and clear
;; hence, call this function after switching to a theme
(defun ttk/hl-line-underline-on ()
  "Enable hl-line underline"
  (interactive)
  (set-face-background 'hl-line nil)
  (set-face-foreground 'hl-line nil)
  (set-face-underline 'hl-line t)
  ;; change cursor's color
  (setq evil-normal-state-cursor '(box "tomato")
        evil-insert-state-cursor '(bar "medium sea green")
        evil-visual-state-cursor '(hollow "orange")))
;;(ttk/hl-line-underline-on)
#+end_src

This is on my TODO list for the next themes:
- [[https://www.reddit.com/r/emacs/comments/t7doal/i_bet_you_use_hllinemode_do_you_know_how_it_works/][How hl-line-mode works]]
- [[https://github.com/rougier/nano-emacs][GNU Emacs/NANO]]
- [[https://github.com/ronisbr/doom-nano-themes][Doom NANO Themes]]

** Line settings

I like relative line number so vertical jumping is easier.

#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
;; (setq display-line-numbers-type 'relative)  ; relative line number
(setq display-line-numbers-type t)      ; absolute line number
#+end_src

Doom Emacs uses 'SPC t' for "toggle" commands, so I choose 'SPC t t' for
toggle-truncate-lines.

#+begin_src emacs-lisp
(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)
#+end_src

** Pulsing Cursor

Ref: [[https://github.com/jasonjckn/pulsing-cursor][github.com/jasonjckn/pulsing-cursor]]

#+begin_src emacs-lisp :tangle packages.el
(package! pulsing-cursor
  :recipe (:host github
           :repo "jasonjckn/pulsing-cursor"))
#+end_src

Configuration:
#+begin_src emacs-lisp
(use-package! pulsing-cursor
  :init
  ;; code here will run immediately
  :config
  ;; code here will run after the package is loaded
  (setq pulsing-cursor-delay 0          ; 0sec
        pulsing-cursor-interval 1.0     ; 1sec
        pulsing-cursor-blinks 10        ; how many blinks before become solid
   )
 ;;(pulsing-cursor-mode +1)               ; enable on start
 (pulsing-cursor-mode -1)               ; disable on start
  )
#+end_src

** Rainbow mode

*** =:tools rgb=

=hl-line-mode= overrides the color highlighting of =rainbow-mode,= limiting the use
of that plugin and on-site color changes using kurecolor. To automatically
disable it only when rainbow-mode is active:

#+begin_src emacs-lisp
(when (modulep! :tools rgb)
  (add-hook! 'rainbow-mode-hook
             (hl-line-mode (if rainbow-mode -1 +1))))
#+end_src

*** Manual package installation

No longer needed because already included in =:tools rgb=.

#+begin_src emacs-lisp :tangle no
(package! rainbow-mode)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! rainbow-mode
  :hook (emacs-lisp-mode . rainbow-mode))
#+end_src

** Rainbow delimiters

I like balanced and colorful delimiters provided by [[https://github.com/Fanael/rainbow-delimiters.git][rainbow-delimiters]].
#+begin_src emacs-lisp :tangle packages.el
(package! rainbow-delimiters)
#+end_src

And configure it only for certain modes.
#+begin_src emacs-lisp
;;
;; balanced and colorful delimiters
;;     https://github.com/Fanael/rainbow-delimiters.git
;;
;; Toggle single buffer: M-x rainbow-delimiters-mode
(use-package! rainbow-delimiters
 ;; if you omit :defer, :hook, :commands, or :after, then the package is loaded
 ;; immediately. By using :hook here, the `rainblow-delimiters` package won't be loaded
 ;; until prog-mode-hook is triggered (by activating a major mode derived from
 ;; it, e.g. python-mode)
 :hook (prog-mode . rainbow-delimiters-mode)
 :init
 ;; code here will run immediately
 :config
 ;; code here will run after the package is loaded
)
#+end_src

** Modeline

Interesting: [[https://www.gonsie.com/blorg/modeline.html][Beautifying the Mode Line]]

