config.el
  (setq doom-font                (font-spec :family "menlo" :size 12)
        doom-variable-pitch-font (font-spec :family "menlo" :size 12)
        doom-big-font            (font-spec :family "menlo" :size 18)))
 ((or IS-IGL6301W IS-OMICRON)
  (setq doom-font                (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-variable-pitch-font (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-big-font            (font-spec :family "Iosevka Fixed SS04 MdEx" :size 18)))
 (IS-COVID
  (setq doom-font                (font-spec :family "Input Mono Condensed" :size 12)
        doom-variable-pitch-font (font-spec :family "Input Mono Condensed" :size 12)
        doom-big-font            (font-spec :family "Input Mono Condensed" :size 18)))
 (IS-IGD1943U
  (setq doom-font                (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-variable-pitch-font (font-spec :family "Iosevka Fixed SS04 MdEx" :size 12)
        doom-big-font            (font-spec :family "Iosevka Fixed SS04 MdEx" :size 18)))
 (IS-LOGE
  (setq doom-font                (font-spec :family "Input Mono Narrow" :size 12)
        doom-variable-pitch-font (font-spec :family "Input Mono Narrow" :size 12)
        doom-big-font            (font-spec :family "Input Mono Narrow" :size 18)))
 (IS-IGD0464U
  (setq doom-font                (font-spec :family "Input Mono Condensed" :size 12)
        doom-variable-pitch-font (font-spec :family "Input Mono Condensed" :size 12)
        doom-big-font            (font-spec :family "Input Mono Condensed" :size 18)))
 (t
  (setq doom-font                (font-spec :family "monospace" :size 12)
        doom-variable-pitch-font (font-spec :family "monospace" :size 12)
        doom-big-font            (font-spec :family "monospace" :size 18))))

(when (featurep! :ui doom)
  (setq doom-themes-enable-bold t      ; if nil, bold i universally disabled
      doom-themes-enable-italic t      ; if nil, italics is universally disabled
  )
  ;; select theme
  (cond
   ((or IS-OMICRON IS-IGD0464U)
    (setq doom-theme 'ttk-doom-solarized-light))
   (IS-IGL6301W
    (setq doom-theme 'ttk-doom-one-light))
   (IS-IGD1943U
    (setq doom-theme 'ttk-doom-one-light))
   (IS-COVID
    (setq doom-theme 'ttk-doom-one-light))
   (IS-DELTA
    (setq doom-theme 'ttk-doom-one-light))
   (t
    (setq doom-theme 'ttk-doom-zenburn)))
  ;; corrects (and improves) org-mode's native fontification
  (doom-themes-org-config))

;; ref: https://github.com/bbatsov/solarized-emacs
;; if you are using emacs under X you might like the following setting which puts
;; the underline below the font bottomline instead of the baseline.
(if (display-graphic-p)
  (progn
   ;; in graphics mode
   (setq x-underline-at-descent-line t))
  ;; else in terminal
  ;; do nothing
  )
;; get the right time to set face of hl-line is a bit tricky
;; each theme has its own way to set and clear
;; hence, call this function after switching to a theme
(defun ttk/hl-line-underline-on ()
  "Enable hl-line underline"
  (interactive)
  (set-face-background 'hl-line nil)
  (set-face-foreground 'hl-line nil)
  (set-face-underline 'hl-line t)
  ;; change cursor's color
  (setq evil-normal-state-cursor '(box "tomato")
        evil-insert-state-cursor '(bar "medium sea green")
        evil-visual-state-cursor '(hollow "orange")))
;;(ttk/hl-line-underline-on)

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type 'relative)  ; relative line number
;; (setq display-line-numbers-type t)      ; absolute line number

(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)

(use-package! pulsing-cursor
  :init
  ;; code here will run immediately
  :config
  ;; code here will run after the package is loaded
  (setq pulsing-cursor-delay 0          ; 0sec
        pulsing-cursor-interval 1.0     ; 1sec
        pulsing-cursor-blinks 10        ; how many blinks before become solid
   )
 ;;(pulsing-cursor-mode +1)               ; enable on start
 (pulsing-cursor-mode -1)               ; disable on start
  )

(when (featurep! :tools rgb)
  (add-hook! 'rainbow-mode-hook
             (hl-line-mode (if rainbow-mode -1 +1))))

;;
;; balanced and colorful delimiters
;;     https://github.com/Fanael/rainbow-delimiters.git
;;
;; Toggle single buffer: M-x rainbow-delimiters-mode
(use-package! rainbow-delimiters
 ;; if you omit :defer, :hook, :commands, or :after, then the package is loaded
 ;; immediately. By using :hook here, the `rainblow-delimiters` package won't be loaded
 ;; until prog-mode-hook is triggered (by activating a major mode derived from
 ;; it, e.g. python-mode)
 :hook (prog-mode . rainbow-delimiters-mode)
 :init
 ;; code here will run immediately
 :config
 ;; code here will run after the package is loaded
)
