packages.el

(package! pulsing-cursor
  :recipe (:host github
           :repo "jasonjckn/pulsing-cursor"))

(package! rainbow-delimiters)
