doom.org
*** doom-modeline

Now is the time to customize modeline, see [[https://seagle0128.github.io/doom-modeline/][doom-modeline]] and the [[https://github.com/seagle0128/doom-modeline#faq][FAQ]].
If you are interested in adding your own segment, please refer to: [[https://www.reddit.com/r/DoomEmacs/comments/ie96qy/truncating_buffer_name_on_mode_line_doommodeline/][reddit link]].
#+begin_src emacs-lisp
(use-package! doom-modeline
 :init
 (setq doom-modeline-percent-position nil ; dunwan buffer % at segment buffer-position
       doom-modeline-project-detection 'projectile ; how to detect project root
       ;; doom-modeline-project-detection 'project ; how to detect project root
       doom-modeline-buffer-file-name-style 'buffer-name ; uniquify buffer name
       doom-modeline-workspace-name nil                  ; need eyebrowse
       doom-modeline-persp-name t                        ; workspace using persp-mode
       doom-modeline-display-default-persp-name t        ; workspace using persp-mode
       doom-modeline-persp-icon nil                      ; workspace using persp-mode
       doom-modeline-lsp nil                             ; no need display lsp state
       ;; Whether display the environment version
       doom-modeline-env-version nil
       ;; Or for individual languages
       doom-modeline-env-enable-python t
       doom-modeline-env-enable-ruby t
       doom-modeline-env-enable-perl t
       doom-modeline-env-enable-go t
       doom-modeline-env-enable-elixir t
       doom-modeline-env-enable-rust t
   )
 :config
  ;; See list of doom-modeline-def-segment in doom-modeline-segments.el
  (doom-modeline-def-modeline 'ttk/my-simple-line
   '(bar vcs persp-name buffer-info-simple major-mode minor-modes buffer-position)
   '(selection-info misc-info))
  ;; Add to `doom-modeline-mode-hook` or other hooks
  (defun setup-custom-doom-modeline ()
   (doom-modeline-set-modeline 'ttk/my-simple-line t))
  (add-hook 'doom-modeline-mode-hook 'setup-custom-doom-modeline)
)
#+end_src

*** which-function-mode
Emacs comes with a minor mode called which-function-mode that shows the current defun –
Lisp lingo for a function, but Emacs-speak for anything that would count as one –
in your modeline by looking at where your point is.

#+begin_src emacs-lisp
;;
;; which-function-mode
;;
(if t
    (which-function-mode 1) ; enable for all modes
  (progn                    ; enable for certain modes
    (require 'which-func)
    (eval-after-load "which-func-modes"
     '(setq which-func-modes '(c-mode cc-mode c++-mode java-mode org-mode python-mode)))
    (which-func-mode 1)))
#+end_src

*** Show current time

Show current time manually with =M-x display-time=.

#+begin_src emacs-lisp
(setq-default
 ;; %H is the hour on a 24-hour clock
 ;; %I is on a 12-hour clock
 ;; %k is like %H only blank-padded
 ;; %l is like %I blank-padded.
 ;; %M is the minute
 ;; %S is the second
 display-time-default-load-average nil
 ;; display-time-format "%p%I:%M"
 display-time-format "%H:%M"
 display-time-interval 60               ; update every 60 sec
 display-time-default-load-average nil  ; don't show load average
 )
 ;; display clock in modeline
 (display-time-mode t)
#+end_src

** Indent guide

How to disable in prog-mode?

Here's how doom configure it [[https://github.com/doomemacs/doomemacs/blob/master/modules/ui/indent-guides/config.el][Doom config for highlisht-indent-guides]].

#+begin_src emacs-lisp :tangle no
;; (when (modulep! :ui indent-guides)
  (with-eval-after-load 'highlight-indent-guides
    (remove-hook 'prog-mode #'highlight-indent-guides-mode))
;; )
#+end_src

** Shrink Whitespace

I've been using it for so many years, can't live without.
See: [[https://github.com/jcpetkovich/shrink-whitespace.el][jcpetkovich github]].

#+begin_src emacs-lisp :tangle packages.el
;; https://github.com/jcpetkovich/shrink-whitespace.el
(package! shrink-whitespace)
#+end_src

#+begin_src emacs-lisp
;; shrink-whitespace.el
;;     https://github.com/jcpetkovich/shrink-whitespace.el.git
;;
;; delete blank lines and shrink whitespace
(use-package! shrink-whitespace
 :defer t
 :bind (("M-\\" . shrink-whitespace)))
#+end_src

** Registers

Ref: [[https://tech.toryanderson.com/2020/07/03/emacs-tip-registers/][The Simple Genius of Emacs Registers]]

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("r" . "register")
       "SPC" #'point-to-register
       "l" #'list-registers
       "i" #'insert-register
       "j" #'jump-to-register
       "s" #'copy-to-register))
#+end_src

** Key bindings

Doom Emacs has an extensive keybinding system, and most module functions are
already bound. I modify some keybindings here.

For =evil-normal-state-map=, see: =~/.emacs.d/.local/straight/repos/evil/evil-maps.el=.

For more, see [[#ref-keybindings]].

*** Emulating vi's =%= key

One of the few things I missed in Emacs from vi was the =%= key, which jumps to the
parenthesis, bracket or brace which matches the one below the cursor. This function
implements this functionality, bound to the same key. Inspired by [[http://www.emacswiki.org/emacs/NavigatingParentheses][NavigatingParentheses]],
but modified to use =smartparens= instead of the default commands, and to work on brackets
and braces.

#+begin_src emacs-lisp
(after! smartparens
  (defun zz/goto-match-paren (arg)
    "Go to the matching paren/bracket, otherwise (or if ARG is not
    nil) insert %.  vi style of % jumping to matching brace."
    (interactive "p")
    (if (not (memq last-command '(set-mark
                                  cua-set-mark
                                  zz/goto-match-paren
                                  down-list
                                  up-list
                                  end-of-defun
                                  beginning-of-defun
                                  backward-sexp
                                  forward-sexp
                                  backward-up-list
                                  forward-paragraph
                                  backward-paragraph
                                  end-of-buffer
                                  beginning-of-buffer
                                  backward-word
                                  forward-word
                                  mwheel-scroll
                                  backward-word
                                  forward-word
                                  mouse-start-secondary
                                  mouse-yank-secondary
                                  mouse-secondary-save-then-kill
                                  move-end-of-line
                                  move-beginning-of-line
                                  backward-char
                                  forward-char
                                  scroll-up
                                  scroll-down
                                  scroll-left
                                  scroll-right
                                  mouse-set-point
                                  next-buffer
                                  previous-buffer
                                  previous-line
                                  next-line
                                  back-to-indentation
                                  doom/backward-to-bol-or-indent
                                  doom/forward-to-last-non-comment-or-eol
                                  )))
        (self-insert-command (or arg 1))
      (cond ((looking-at "\\s\(") (sp-forward-sexp) (backward-char 1))
            ((looking-at "\\s\)") (forward-char 1) (sp-backward-sexp))
            (t (self-insert-command (or arg 1))))))
  (map! "%" 'zz/goto-match-paren))
#+end_src

* Tree-Sitter

** Use Emacs-Tree-Sitter for Hightlighting in Doom Emacs

Note on 1-July-2022: This section is no longer needed. Doom Emacs has module tree-sitter
in =tools/tree-sitter=.

Ref:
- [[https://github.com/doomemacs/doomemacs/tree/master/modules/tools/tree-sitter][Doom Emacs: tools/tree-sitter]]
- [[https://abdelhakbougouffa.pro/posts/config/][Abdelhak's Blog: Doom Emacs Configuration]]
- [[https://github.com/doomemacs/doomemacs/tree/master/modules/tools/tree-sitter][Parser for these languages]]
- [[https://emacs-tree-sitter.github.io/syntax-highlighting][These languages]]

Section below is now obsolete.

Ref: [[https://hungyi.net/posts/use-emacs-tree-sitter-doom-emacs/][Use Emacs-Tree-Sitter for Hightlighting in Doom Emacs]]

#+begin_src emacs-lisp :tangle no
(package! tree-sitter)
(package! tree-sitter-langs)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! tree-sitter
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))
#+end_src

* Evil
** General

Ref: [[https://github.com/hlissner/doom-emacs/tree/develop/modules/editor/evil][Doom editor/evil]]

#+begin_src emacs-lisp
(when (modulep! :editor evil)
  (setq-default
    ;; i don't like the o/O keys will respect and continue commented lines, so disable it.
    +evil-want-o/O-to-continue-comments nil
    ;; if t then these will make cursor follow the new splitted window
    evil-split-window-below nil     ; t: follow new splitted window, nil: remain
    evil-vsplit-window-below nil    ; t: follow new splitted window, nil: remain
    ;; let's mimic the original vim behavior and don't make mistakes
    evil-want-fine-undo t
  )
  ;;
  (after! evil
    (setq evil-move-cursor-back t       ; default: move the block cursor when toggling insert mode
          evil-kill-on-visual-paste nil ; don't put overwritten text in the kill ring
          )))
#+end_src

** Move Around

So many ways to move around. The lazy =j=, =k=, =l=, =h= are in many ways too slow.
You can train yourself with Evil Motion Trainer to kill the habit of =jklh=.

I categorize my movement into 3 categories:

