packages.el

;; https://github.com/jcpetkovich/shrink-whitespace.el
(package! shrink-whitespace)
