doom.org
*** Vertical Movement

Ref: [[https://github.com/PythonNut/evil-easymotion][evil-easymotion]].

Moving down: =gsj=, moving up: =gsk=.

It's better than relative line number, as I don't have to switch to
the left and type =12j=. I just look at where I want to go, type =gsj=
and press the letter that pops up.

*** Horizontal Movement

Ref: [[https://github.com/hlissner/evil-snipe][evil-snipe]] and [[https://noelwelsh.com/posts/2019-01-10-doom-emacs.html][Noel Welsh's Doom Emacs Workflows]].

Moving forward: =s??=, moving backward: =S??=. The last snipe with =s=.

Eg: =Cook coca-cola chicken= and wanting to jump to =chicken=.

Sure you can press =fc= a few times, or maybe jump through with =w=. But
instead, you could type =sch=.

*** Arbitrary Movement

Ref: =evil avy goto char 2=

Bound to =gss=

** evil-mc

*** Incompatibility

Ref: [[https://www.reddit.com/r/emacs/comments/iu0euj/getting_modern_multiple_cursors_in_emacs/][evil-mc incompatibility]]. Evil-mc is incompatible with lispy-mode and yas-minor-mode:

#+begin_src emacs-lisp
(after! evil-mc
  (add-to-list 'evil-mc-incompatible-minor-modes 'lispy-mode)
  (add-to-list 'evil-mc-incompatible-minor-modes 'yas-minor-mode))
#+end_src

*** Hydra

Copy and paste from: [[https://hungyi.net/posts/hydra-for-evil-mc/][An evil-mc Emacs Hydra]]

One thing sorely lacking in native Emacs is the ability to edit with multiple cursors
like VS Code. Fortunately for Doom Emacs or Evil users, there’s evil-mc. But even with
that installed, all it gives you is a bunch of commands you still have to decide how to
bind them yourself or rely on Doom’s suggested bindings that map everything to the =g z=
prefix for every command.

But I think we can do better. Today, I’m sharing an Emacs =hydra= that I’ve been using
to power up my evil-mc usage. Just put this anywhere in your config.el:

#+begin_src emacs-lisp
(defhydra my-mc-hydra (:color pink
                       :hint nil
                       :pre (evil-mc-pause-cursors))
  "
^Match^            ^Line-wise^           ^Manual^
^^^^^^----------------------------------------------------
_Z_: match all     _J_: make & go down   _z_: toggle here
_m_: make & next   _K_: make & go up     _r_: remove last
_M_: make & prev   ^ ^                   _R_: remove all
_n_: skip & next   ^ ^                   _p_: pause/resume
_N_: skip & prev

Current pattern: %`evil-mc-pattern

"
  ("Z" #'evil-mc-make-all-cursors)
  ("m" #'evil-mc-make-and-goto-next-match)
  ("M" #'evil-mc-make-and-goto-prev-match)
  ("n" #'evil-mc-skip-and-goto-next-match)
  ("N" #'evil-mc-skip-and-goto-prev-match)
  ("J" #'evil-mc-make-cursor-move-next-line)
  ("K" #'evil-mc-make-cursor-move-prev-line)
  ("z" #'+multiple-cursors/evil-mc-toggle-cursor-here)
  ("r" #'+multiple-cursors/evil-mc-undo-cursor)
  ("R" #'evil-mc-undo-all-cursors)
  ("p" #'+multiple-cursors/evil-mc-toggle-cursors)
  ("q" #'evil-mc-resume-cursors "quit" :color blue)
  ("<escape>" #'evil-mc-resume-cursors "quit" :color blue))
#+end_src

And since I’m using Doom Emacs, I’ve bound it to the prefix =g z= to stay somewhat in line
with the default setup. Note that binding it this way will make this hydra replace *all* of
the previous multiple cursor bindings under =g z=.

#+begin_src emacs-lisp
(map!
 (:when (modulep! :editor multiple-cursors)
  :prefix "g"
  :nv "z" #'my-mc-hydra/body))
#+end_src

**** Why Use a Hydra?

A hydra lets us enter and stay in a “multiple cursor creation mode” without having to
press a bunch of prefix keys or modifiers before every command. This fit the way I
used multiple cursors on a conceptual level:

1. Create all the cursors in the appropriate places; then
2. Check if all the cursors are perfect; if they are
3. Start text editing.

Because steps 1 and 2 purely involve multiple cursor stuff, it’s perfectly OK for
some of the regular editing keys to be commandeered for the sole purpose of manipulating
cursors.

And yes, it’s useful to have the movement keys still available when messing around
with cursors, which brings us to...

**** Notable Benefits

1. *Most movement keys are still free to be used while in the hydra.*
   The =:color= is set to =pink= so that keys that are foreign to the hydra are still passed
   through without complaint. I’ve also chosen keys that don’t interfere with basic
   vim movement.

2. *Automatically pause all evil-mc cursors when entering the hydra.*
   I always found it annoying that the cursors could move around while I was setting
   them up. No other editor I’ve used so far has had any (obvious) way of freezing
   the cursors during set up, but this hydra can. You can also control the pausing
   manually by using =p.=

3. *Automatically unfreeze all evil-mc cursors when exiting the hydra,* ready for editing.

4. *Allows easy skipping of matching text without creating cursors* using the =n= and =N= keys.
   This is roughly similar to the regular vim searching behavior, so it’s easier for
   me to remember.

5. *Easy access to correction commands*, like toggle at point =z=, remove last mistake =r=
   or remove all =R= to start again.
   Multiple cursors is messy, and I almost never get it right on the first try, but this
   makes it easy to reset and get back on track using very few keystroke.

6. *Just hold shift to make cursors vertically up and down* with =K= and =J=.
   Skipping is easy too. Just let go of shift and use the regular vim =k= and =j= movement keys.

I’ve left out bindings for commands like =evil-mc-make-and-goto-next-cursor= and
=evil-mc-skip-and-goto-prev-cursor= as well as all of the cursor-specific navigation
keys because I rarely use them right now.

Of course, you’re free to bind them yourself. Might I suggest using some of these
directional keys? =[= =]= =<= =>=.

*** Working With Smartparens

Ref: [[https://hungyi.net/posts/how-to-evil-mc-smartparens/][How to Quickly Get evil-mc Working With Smartparens]]

[[https://philjackson.github.io/elisp/evil-mc/smartparens/emacs/2021/06/05/smartparens-and-evil-mc/][As described here]], when using =evil-mc=, it's very frustrating when a =smartparens=
command works on only the first of the multiple cursors.

Here's how to fix that:

#+begin_src emacs-lisp
(after! (:and evil-mc smartparens)
  (dolist (sp-command '(sp-up-sexp
                        sp-copy-sexp
                        sp-down-sexp
                        sp-join-sexp
                        sp-kill-sexp
                        sp-next-sexp
                        sp-split-sexp
                        sp-wrap-curly
                        sp-wrap-round
                        sp-raise-sexp
                        sp-clone-sexp
                        sp-wrap-square
                        sp-splice-sexp
                        sp-end-of-sexp
                        sp-forward-sexp
                        sp-backward-sexp
                        sp-convolute-sexp
                        sp-transpose-sexp
                        sp-kill-whole-line
                        sp-beginning-of-sexp
                        sp-forward-barf-sexp
                        sp-forward-slurp-sexp
                        sp-backward-barf-sexp
                        sp-backward-slurp-sexp
                        sp-splice-sexp-killing-forward
                        sp-splice-sexp-killing-backward))
    (add-to-list
     'evil-mc-custom-known-commands
     `(,sp-command
       (:default . evil-mc-execute-call)))))
#+end_src

** Evil Escape

I don't use =evil-escape-mode= and I heard it contributes to a typing delay.
So, let's just disable it.

Update: Instead of disabling evil-escape-mode, better just prevent the
installation of the package by removing it, see [[Disabling Packages]].

#+begin_src emacs-lisp :tangle no
(after! evil-escape (evil-escape-mode -1))
#+end_src

** Evil Motion Trainer

Read: [[https://martin.baillie.id/wrote/evil-motion-training-for-emacs/][Emacs Evil Motion Training]]. Github: [[https://github.com/martinbaillie/evil-motion-trainer][evil-motion-trainer]].

Let's install it:
#+begin_src emacs-lisp :tangle packages.el
(package! evil-motion-trainer
  :recipe (:host github
           :repo "martinbaillie/evil-motion-trainer"
           :files ("*.el")))
#+end_src

Now, configure it:
#+begin_src emacs-lisp
(use-package! evil-motion-trainer
  :init
  :config
  (setq evil-motion-trainer-threshold 6
        evil-motion-trainer-super-annoying-mode nil)
  ;; (global-evil-motion-trainer-mode 1)    ; enable
  (global-evil-motion-trainer-mode 0)       ; disable
 )
#+end_src

** Evil Visualstar

- Select something in visual mode with =v= or =V=
- Press =#= (search forward) or =*= (search backward)

See: [[https://emacs.stackexchange.com/questions/52411/evil-star-visualstar-without-moving-the-cursor][Evil visualstart without moving the cursor]], but below does not work. Disable first.
#+begin_src emacs-lisp :tangle no
(after! evil-visualstar
  (defun my/star-keep-position ()
    (interactive)
    (case evil-search-module
      (evil-search (progn
                    (evil-ex-search-word-forward)
                    (evil-ex-search-previous)))
      (isearch (progn
                 (evil-search-word-forward)
                 (evil-search-previous)))))

  (defun my/visualstar-keep-position ()
    (interactive)
    (when (region-active-p)
        (evil-visualstar/begin-search (region-beginning) (region-end) t)
        (case evil-search-module
        (evil-search (evil-ex-search-previous))
        (isearch (evil-search-previous)))))

  (evil-define-key 'normal evil-motion-state-map (kbd "*") 'my/star-keep-position)
  (evil-define-key 'visual evil-visualstar-mode-map (kbd "*") 'my/visualstar-keep-position))
#+end_src

** Evil Exchange

Easy text swap operator, see [[https://github.com/Dewdrops/evil-exchange][evil-exchange]].

First, in visual mode, select text then =gx=. Go to another text to swap with, in visual mode,
select text then =gx= again to swap with the previus text.

** Reference

- [[https://www.baeldung.com/linux/text-objects-in-vim][Text Objects in Vim]].
- [[https://www.youtube.com/watch?v=SIePe-A4rs0][YouTube: vim: Text objects]]
- [[https://www.youtube.com/watch?v=tQKtJyI5cFk][YouTube: vi: Text object motions]]
- [[https://www.youtube.com/watch?v=c4P2hzVPDbY][YouTube: vim: Copyting and moving text]]
- [[https://www.youtube.com/watch?v=E7NBhSsZouc][YouTube: Vim Life Ep 7: Coolest Vim Command]]
- [[https://www.youtube.com/watch?v=H3o4l4GVLW0][Youtube: Vim As Your Editor (1/6): The Basic Vim Movements]]
- [[https://www.youtube.com/watch?v=gSHf_b6AWKc][YouTube: Vim As Your Editor (2/6): Foundation for Speed]]
- [[https://www.youtube.com/watch?v=Q6mr7w0YmkQ][YouTube: Vim As Your Editor (3/6): Horizontal Speed]]
- [[https://www.youtube.com/watch?v=4uPRlnTUlMY][YouTube: Vim As Your Editor (4/6): Vertical Domination]]

To investigate:

- [[https://github.com/yyoncho/evil-repeat-motion][evil-repeat-motion]]

* abo-abo
** avy

*** avy-goto-line

This is my first key mapping effort, ref: [[https://rameezkhan.me/adding-keybindings-to-doom-emacs][Adding keybindings to doom emacs]] and
[[https://github.com/hlissner/doom-emacs/issues/2725][Add keys to evil-easymotion]]. Currently it's not being mapped to any keybinding. So,

#+begin_src emacs-lisp
;; see ~/.emacs.d/modules/editor/evil/config.el
(map! :after evil-easymotion
  :map evilem-map
   "l" #'evil-avy-goto-line
;; "p" #'avy-pop-mark  ; better-jumper-jump-backword (C-o) as general jump backward
)
#+end_src

To browse both local and global mark rings:
#+begin_example
M-x counsel-mark-ring (SPC s r)
#+end_example

*** Avy Can Do Anything

Ref: [[https://karthinks.com/software/avy-can-do-anything/][Avy can do anything]]

**** Kill a candidate word, sexp or line

#+begin_src emacs-lisp
(after! avy
  (defun avy-action-kill-whole-line (pt)
  (save-excursion
      (goto-char pt)
      (kill-whole-line))
  (select-window
  (cdr
      (ring-ref avy-ring 0)))
  t)
  ;;
  (setf (alist-get ?K avy-dispatch-alist) 'avy-action-kill-whole-line
        ; (alist-get ?k avy-dispatch-alist) 'avy-action-kill-stay     ;; doom default ?X
        )
 )
#+end_src

