doom.org
**** Yank a candidate word, sexp or line

#+begin_src emacs-lisp
(after! avy
  (defun avy-action-copy-whole-line (pt)
    (save-excursion
      (goto-char pt)
      (cl-destructuring-bind (start . end)
          (bounds-of-thing-at-point 'line)
        (copy-region-as-kill start end)))
    (select-window
     (cdr
      (ring-ref avy-ring 0)))
    t)
  ;;
  (defun avy-action-yank-whole-line (pt)
    (avy-action-copy-whole-line pt)
    (save-excursion (yank))
    t)
  ;;
  (setf ; (alist-get ?y avy-dispatch-alist) 'avy-action-yank             ; doom default ?y
        ; (alist-get ?w avy-dispatch-alist) 'avy-action-copy             ; doom default ?n
        (alist-get ?W avy-dispatch-alist) 'avy-action-copy-whole-line
        (alist-get ?Y avy-dispatch-alist) 'avy-action-yank-whole-line  ; override doom yang-line (?Y)
        )
 )
#+end_src

*** Avy Actions are Awesome!

Ref: [[https://ag91.github.io/blog/2022/04/20/repeat-with-me-avy-actions-are-awesome/][Repeat with me: Avy actions are awesome!]]

To read the article later!

** ivy

[27-Jan-2022] I'm now using =vertico= as the search engine instead of =ivy=.
=vertico= is now also default search engine in Doom.

#+begin_src emacs-lisp :tangle no
(after! ivy
 (setq ivy-height 16
       ivy-count-format "(%d/%d)"    ; display the current and total number in the collection
       counsel-git-cmd "rg --files"
       ;; already defined in doom emacs config
       ;counsel-rg-base-command "rg -i -M 120 --no-heading --line-number --color never %s ."
       ;; https://oremacs.com/2017/08/04/ripgrep/
       counsel-grep-base-command "rg -i -M 120 --no-heading --line-number --color never '%s' %s"
       )
 ;; i don't like dir buffer.
 (define-key ivy-minibuffer-map (kbd "RET") 'ivy-alt-done)
 )
#+end_src

* Vertico & Co

Vertico is Doom's default completion system: [[https://github.com/hlissner/doom-emacs/tree/master/modules/completion/vertico][Doom Emacs Vertico Module]].

Other Refs:
- [[https://macowners.club/posts/from-ivy-to-vertico/][From Ivy & Counsel to Vertico & Consult]]
- [[https://cestlaz.github.io/post/using-emacs-80-vertico/][Using Emacs Episode 80 Vertico, Marginalia, Consult and Embark]]
- [[https://systemcrafters.cc/emacs-tips/streamline-completions-with-vertico/][System Crafters: Streamline Your Emacs Completions with Vertico]]
- [[https://irreal.org/blog/?p=9699][Irreal: Ivy to Selectrum]]
- [[https://www.rousette.org.uk/archives/switching-to-selectrum-for-incremental-narrowing-in-emacs/][Switching to Selectrum for incremental narrowing in Emacs]]
- [[https://emacsredux.com/blog/2021/04/19/configuring-minibuffer-completion-in-projectile/][Emacs Redux: Configuring Minibuffer Completion in Projectile]]
- [[https://hungyi.net/posts/doom-emacs-search-replace-project/][Hungyi: How to Do a Project-wide Search and Replace in Doom Emacs]]
- [[https://kristofferbalintona.me/posts/vertico-marginalia-all-the-icons-completion-and-orderless/][Kristoffer Balintona: Vertico, Marginalia, All-the-icons-completion and Orderless]]
- [[https://karthinks.com/software/fifteen-ways-to-use-embark/][karthinks: Fifteen Ways to Use Embark]]

** Project-wide Search and Replace

Reference: [[https://hungyi.net/posts/doom-emacs-search-replace-project/][How to Do a Project-wide Search & Replace in Doom Emacs]].

#+begin_example
SPC s p foo C-; E C-c C-p :%s/foo/bar/g RET Z Z
#+end_example

Entering those keys will replace "foo" with "bar" in your whole project.

* Org

I have been a fan of the idea of [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]] for many years, but Org is the first
tool I have encountered which makes it practical. Here are some of the resources I have
found useful in learning it:

- Howard Abrams: [[http://www.howardism.org/Technical/Emacs/literate-programming-tutorial.html][Introduction to Literate Programming]], which got me jumpstarted into writing
  code documented with org-mode.
- Nick Anderson: [[https://github.com/nickanderson/Level-up-your-notes-with-Org][Level up your notes with Org]], which contains many useful tips and
  configuration tricks. Nick's recommendation also got me to start looking into Org-mode
  in the first place!
- Sacha Chua: [[http://sachachua.com/blog/2014/01/tips-learning-org-mode-emacs/][Some tips for learning Org Mode for Emacs]], her [[http://pages.sachachua.com/.emacs.d/Sacha.html][Emacs configuration]] and
  many of her [[http://sachachua.com/blog/category/emacs/][other articles]].
- Rainer König: [[https://www.youtube.com/playlist?list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE][OrgMode Tutorial]] video series.
- System Crafters Youtube: [[https://www.youtube.com/watch?v=AyhPmypHDEw&t=2007s][Gettring Started with Org Roam v2]].
- Peter Prevos: [[https://lucidmanager.org/productivity/taking-notes-with-emacs-org-mode-and-org-roam/][Taking Notes with Emacs Org Mode and Org Roam]].
- Where parallels cross: [[https://ag91.github.io/blog/2021/03/12/find-org-roam-notes-via-their-relations/][Find Org Roam notes via their relations]]

** General Org Configuration

Default directory for Org files.

#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

Hide Org markup indicators such as *bold*, /italic/, etc.
More: [[https://emacstil.com/til/2021/11/26/make-org-emphasis-code-verbatim-bold-look-nicer/][Hide leading/trailing emphasis margers in Org]].

#+begin_src emacs-lisp
(after! org (setq org-hide-emphasis-markers t))
#+end_src

Insert Org headings at point, not after the current subtree (this is enabled by
default by Doom).

#+begin_src emacs-lisp
(after! org (setq org-insert-heading-respect-content nil))
#+end_src

Enable logging of done tasks, and log stuff into the LOGBOOK drawer by default.

#+begin_src emacs-lisp
(after! org
  (setq org-log-done t)
  (setq org-log-into-drawer t))
#+end_src

Use the special ~C-a~, ~C-e~ and ~C-k~ definitions for Org, which enable some special
behavior in headings.

#+begin_src emacs-lisp
(after! org
  (setq org-special-ctrl-a/e t)
  (setq org-special-ctrl-k t))
#+end_src

Enable [[https://orgmode.org/manual/Speed-keys.html][Speed Keys]], which allows quick single-key commands when the cursor is placed
on a heading. Usually the cursor needs to be at the beginning of a headline line,
but defining it with this function makes them active on any of the asterisks at
the beginning of the line.

#+begin_src emacs-lisp
(after! org
  (setq org-use-speed-commands
        (lambda ()
          (and (looking-at org-outline-regexp)
               (looking-back "^\**")))))
#+end_src

Disable [[https://code.orgmode.org/bzg/org-mode/src/master/etc/ORG-NEWS#L323][electric-mode]], which is now respected by Org and which creates some confusing
indentation sometimes.

#+begin_src emacs-lisp
(add-hook! org-mode (electric-indent-local-mode -1))
#+end_src

Default folding is very noisy, rarely need to see everything expanded.

#+begin_src emacs-lisp
(after! org (setq org-startup-folded 'fold))
#+end_src

** Org visual settings

Enable visual line mode in Org mode by default.

#+begin_src emacs-lisp
(add-hook! org-mode :append
           #'visual-line-mode)
#+end_src

Use [[https://github.com/awth13/org-appear][org-appear]] to reveal emphasis markers when moving the cursor over them.

#+begin_src emacs-lisp :tangle packages.el
(package! org-appear)
#+end_src

And enable it automatically on org-mode start-up:

#+begin_src emacs-lisp
(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :init
  ;; code here will run immediately
  :config
  ;; code here will run after the package is loaded
  (setq org-appear-autolinks t
        org-appear-autosubmarkers t
        org-appear-autoentities t
        org-appear-autokeywords t))
#+end_src

** Org Roam

[24-sep-2022] Seldom use org-roam, so disable first.

*** Configuration

Yes, only for Org Roam v2.

#+begin_src emacs-lisp :tangle no
(setq org-roam-directory "~/project/org-roam"
      +org-roam-open-buffer-on-find-file nil)
#+end_src

*** Front end

Ref: [[https://github.com/org-roam/org-roam-ui][org-roam-ui]]

#+begin_src emacs-lisp :tangle no
(package! websocket)
(package! org-roam-ui
  :recipe (:host github
           :repo "org-roam/org-roam-ui"
           :files ("*.el" "out")))
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
    ;; :hook
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
    ;; :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

** Exporting a Curriculum Vitae

Ref: [[https://gitlab.com/zzamboni/vita][Curriculum Vitae with Org-mode]].

=org-cv= is not available on melpa yet, hence, install from the source:

#+begin_src emacs-lisp :tangle packages.el
(package! org-cv
  :recipe (:host gitlab
           :repo "Titan-C/org-cv"
           :branch "master"))
#+end_src

And load it:

#+begin_src emacs-lisp
(use-package! ox-awesomecv
  :after org)
#+end_src

This command to export current org-cv file to latex for further processing.

#+begin_src emacs-lisp
(defun ttk/org-export-to-file-awesomecv-tex ()
  (interactive)
  (let ((outfile (org-export-output-file-name ".tex")))
    (org-export-to-file 'awesomecv outfile)))
#+end_src

** Reveal.js presentations

On major version update on reveal.js, see [[https://www.reddit.com/r/emacs/comments/hiaqdj/doom_emacs_revealjs_does_it_work_for_you/][reveal.js on doom emacs]].

To fix, add this on your org file:
#+begin_example
#+REVEAL_ROOT: file:///path/to/reveal.js
#+end_example

** Org-tree-slide

Ref: [[https://github.com/hlissner/doom-emacs/issues/4646][org-tree-slide-mode bugs]]

#+begin_src emacs-lisp
(after! org-tree-slide
  ;; h-bauer 25-june-2021: When arriving on a subsection, the narrow did not occur as expected.
  ;; The first sub-section was unfolded, the next two where still visible. I could not go further
  ;; with the binding, unless moving the cursor to the next sibling. would then unfold the
  ;; next sibling, but to move to the next section with, I had to move the cursor to the
  ;; last line of the last sub-section.
  ;; After some investigation, I fixed my issue by removing the following advice :
  (advice-remove 'org-tree-slide--display-tree-with-narrow
                 #'+org-present--hide-first-heading-maybe-a)
  ;; display inline image
  (add-hook 'org-tree-slide-mode-after-narrow-hook
            #'org-display-inline-images)
  ;; this is my own profile
  (defun ttk/org-tree-slide-simple-presentation-profile ()
    (interactive)
    (setq org-tree-slide-header nil
          org-tree-slide-slide-in-effect t))
 )
#+end_src

