doom.org
** Publishing Project

Publishing the website.

Very important, if anything weird then delete entirely this folder:
#+begin_example
$ rm -rf ~/.emacs.d/.local/cache/org-timestamps
#+end_example

#+begin_src emacs-lisp
(after! org
  ;; Project Tree
  (setq org-publish-project-alist
   '(;;
     ;; SSDC project
     ;;
     ("ssdc-notes"
       :base-directory "~/project/stotok/ssdc/org/"
       :base-extension "org"
       :publishing-function org-html-publish-to-html
       :publishing-directory "~/project/stotok/ssdc/bo/html/"
       :recursive t
       :headline-levels 4             ; Just the default for this project.
       :auto-preamble t)
     ("ssdc-static"
       :base-directory "~/project/stotok/ssdc/org/"
       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
       :publishing-directory "~/project/stotok/ssdc/bo/html/"
       :recursive t
       :publishing-function org-publish-attachment)
     ("ssdc-org-html-themes"
       :base-directory "~/project/thirdp/org-html-themes/src/"
       :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
       :publishing-directory "~/project/stotok/ssdc/bo/html/src/"
       :recursive t
       :publishing-function org-publish-attachment)
     ("ssdc-org" :components ("ssdc-notes" "ssdc-static" "ssdc-org-html-themes"))
    ;;
    ;; CTDC project
    ;;
    ("ctdc-notes"
      :base-directory "~/project/conti/ctdc/org/"
      :base-extension "org"
      :publishing-directory "~/project/conti/ctdc/bo/html/"
      :recursive t
      :publishing-function org-html-publish-to-html
      :headline-levels 4             ; Just the default for this project.
      :auto-preamble t)
    ("ctdc-static"
      :base-directory "~/project/conti/ctdc/org/"
      :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
      :publishing-directory "~/project/conti/ctdc/bo/html/"
      :recursive t
      :publishing-function org-publish-attachment)
    ("ctdc-org-html-themes"
      :base-directory "~/project/thirdp/org-html-themes/src/"
      :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
      :publishing-directory "~/project/conti/ctdc/bo/html/src/"
      :recursive t
      :publishing-function org-publish-attachment)
    ("ctdc-org" :components ("ctdc-notes" "ctdc-static" "ctdc-org-html-themes"))
    ))
  ;; Source code block evaluated during export. I don't want to be asked everytime :)
  (setq org-confirm-babel-evaluate nil)
  )
#+end_src

** Anki Decks with Orgmode

Ref:
- [[https://rgoswami.me/posts/anki-decks-orgmode/][Anki Decks with Orgmode]].
- [[https://yiufung.net/post/anki-org/][Power up Anki with Emacs and more]]

Let's install the package:
#+begin_src emacs-lisp :tangle packages.el
(package! anki-editor
  :recipe (:host github
           :repo "louietan/anki-editor"))
#+end_src

Let's configure it:
#+begin_src emacs-lisp
(use-package! anki-editor
  :after org-noter
  :config
  (setq anki-editor-create-decks t ; Allow anki-editor to create a new deck if it does not exist
        anki-editor-org-tags-as-anki-tags t
   ))
#+end_src

** The Orgtbl Minor mode

Ref: [[https://orgmode.org/manual/Orgtbl-Mode.html#Orgtbl-Mode][The Orgtbl Minor Mode]].
We can toggle the mode with =M-x orgtbl-mode=.

To turn it on by default, for example in Message mode, use:

#+begin_example
(add-hook 'message-mode-hook 'turn-on-orgtbl')
#+end_example

** Table.el
Ref: [[https://github.com/emacs-mirror/emacs/blob/master/lisp/textmodes/table.el][table.el by Takaaki Ota]].
Ref: [[https://emacs.stackexchange.com/questions/38135/wrap-cell-content-in-an-org-mode-table][2 Modes: org-table and table.el]].
Ref: [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Text-Based-Tables.html][Editing Text-based Tables]].
Ref: [[https://emacsnotes.wordpress.com/2022/06/20/how-to-create-a-table-with-multi-paragraph-content-spanned-cells-using-emacs-org-mode/][How to create a Table with multi-paragraph content & spanned cells using Emacs Org Mode]]

* Coding

** Tangle-on-save

Ref:
- [[https://zzamboni.org/post/my-doom-emacs-configuration-with-commentary/][Zzamboni Coding Section]]
- [[https://github.com/yilkalargaw/org-auto-tangle][Github: org-auto-tangle]]

Install package:
#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src

And configure it:
#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
   ;; i want nil by default, then set #+auto_tangle: t in each org file
   (setq org-auto-tangle-default nil
    ))
#+end_src

If we want to manual tangle: =M-x org-babel-tangle=.

* Template

** File Template

Doom has file template based on yasnippet when you enable with =:editor file-templates=.

Ref: [[http://www.hoowl.se/auto_inserting_gitignore_templates_in_emacs.html][Auto-insert .gitignore templates in Doome Emacs]].

#+begin_src emacs-lisp
(when (modulep! :editor file-templates)
  ;;
  ;; Ref: http://www.hoowl.se/auto_inserting_gitignore_templates_in_emacs.html
  ;;
  ;; .gitignore templates
  ;; $ mkdir ~/dotdoomemacs/templates
  ;; $ cd ~/dotdoomemacs/templates
  ;; $ git clone https://github.com/github/gitignore
  (defun ttk/template-insert-gitignore()
    (interactive)
    (let* ((dir (concat doom-private-dir "/templates/gitignore/"))
           (files (directory-files dir nil ".*\\.gitignore"))
           (pick (yas-choose-value (mapcar #'file-name-sans-extension files))))
      (insert-file-contents (concat dir (concat pick ".gitignore")))))
  ;; register the template
  (set-file-template! "\\.gitignore$" :trigger 'hanno/template-insert-gitignore :mode 'gitignore-mode)
  ;;
  ;; python templates
  (defun ttk/template-insert-python()
    (interactive)
    (let* ((dir (concat doom-private-dir "/templates/python/"))
           (files (directory-files dir nil ".*\\.py"))
           (pick (yas-choose-value (mapcar #'file-name-sans-extension files))))
      (insert-file-contents (concat dir (concat pick ".py")))))
  ;; register the template
  (set-file-template! "\\.py$" :trigger 'ttk/template-insert-python :mode 'python-mode))
#+end_src

