doom.org
**** Windows
- wheel (system wide: C:\Python311\Scripts)
#+begin_example
C:\Users\uia53572>C:\Python311\Scripts\pip3 install wheel
Collecting wheel
  Downloading wheel-0.38.4-py3-none-any.whl (36 kB)
Installing collected packages: wheel
  WARNING: The script wheel.exe is installed in 'C:\Python311\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed wheel-0.38.4
#+end_example

- virtualenv (system wide: C:\Python311\Scripts)
#+begin_example
C:\Users\uia53572>C:\Python311\Scripts\pip3 install virtualenv
Collecting virtualenv
  Downloading virtualenv-20.17.1-py3-none-any.whl (8.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.8/8.8 MB 12.9 MB/s eta 0:00:00
Collecting distlib<1,>=0.3.6
  Downloading distlib-0.3.6-py2.py3-none-any.whl (468 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 468.5/468.5 kB 5.9 MB/s eta 0:00:00
Collecting filelock<4,>=3.4.1
  Downloading filelock-3.9.0-py3-none-any.whl (9.7 kB)
Collecting platformdirs<3,>=2.4
  Downloading platformdirs-2.6.2-py3-none-any.whl (14 kB)
Installing collected packages: distlib, platformdirs, filelock, virtualenv
  WARNING: The script virtualenv.exe is installed in 'C:\Python311\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed distlib-0.3.6 filelock-3.9.0 platformdirs-2.6.2 virtualenv-20.17.1
#+end_example

- pipenv (user wide: C:\Users\uia53572\AppData\Roaming\Python\Python311\Scripts)
#+begin_example
C:\Users\uia53572>C:\Python311\Scripts\pip3 install --user pipenv
Collecting pipenv
  Downloading pipenv-2023.2.4-py3-none-any.whl (2.9 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.9/2.9 MB 16.6 MB/s eta 0:00:00
Collecting certifi
  Downloading certifi-2022.12.7-py3-none-any.whl (155 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 155.3/155.3 kB ? eta 0:00:00
Requirement already satisfied: setuptools>=36.2.1 in c:\python311\lib\site-packages (from pipenv) (65.5.0)
Collecting virtualenv-clone>=0.2.5
  Downloading virtualenv_clone-0.5.7-py3-none-any.whl (6.6 kB)
Requirement already satisfied: virtualenv in c:\python311\lib\site-packages (from pipenv) (20.17.1)
Requirement already satisfied: distlib<1,>=0.3.6 in c:\python311\lib\site-packages (from virtualenv->pipenv) (0.3.6)
Requirement already satisfied: filelock<4,>=3.4.1 in c:\python311\lib\site-packages (from virtualenv->pipenv) (3.9.0)
Requirement already satisfied: platformdirs<3,>=2.4 in c:\python311\lib\site-packages (from virtualenv->pipenv) (2.6.2)
Installing collected packages: virtualenv-clone, certifi, pipenv
  WARNING: The script virtualenv-clone.exe is installed in 'C:\Users\uia53572\AppData\Roaming\Python\Python311\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
  WARNING: The scripts pipenv-resolver.exe and pipenv.exe are installed in 'C:\Users\uia53572\AppData\Roaming\Python\Python311\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed certifi-2022.12.7 pipenv-2023.2.4 virtualenv-clone-0.5.7
#+end_example

Then add to the PATH:
#+begin_example
1: Execute in DOS command: "C:>sysdm.cpl"
2: Go to advanced tab, open "Environment Variables..."
3: Edit PATH.  Add "C:\Users\uia53572\AppData\Roaming\Python\Python311\Scripts"
#+end_example

Reboot your laptop.

*** .bashrc

#+begin_example
### with this, pipenv will now place the virtualenv inside
### the project folder, emacs will see it and activate it
# export PIPENV_VENV_IN_PROJECT=1
### change to WORKON_HOME due to multi env windows and WSL
export WORKON_HOME=/mnt/d/DSUsers/uia53572/.venvs/linux
#+end_example

*** windows environment variable
#+begin_example
1: Execute in DOS command: "C:>sysdm.cpl"
2: Go to advanced tab, open "Environment Variables..."
3: New User Variable
4: Variable Name: "WORKON_HOME", Variable value: "D:\DSUsers\uia53572\.venvs\windows"
#+end_example

Then reboot your laptop

*** Create/Activate virtual environment

**** Spawn a shell in a virtual environment
#+begin_example
$ cd <your project root>
#+end_example

***** First time (create virtual env)
#+begin_example
$ pipenv shell --python 3.7 (first time to create venv)
#+end_example

***** Next time (virtual env already created, ie =Pipfile= already exist)
#+begin_example
$ pipenv shell
#+end_example

**** Install pacakges

***** First time
#+begin_example
$ pipenv install autoflake flake8 epc importmagic 'python-language-server[all]' 'ptvsd>=4.2'
$ pipenv install pyls-isort pyls-mypy pyls-black
$ pipenv install <python library needed by your project>
#+end_example

***** Next time (after cloning from git repo, install from Pipfile and Pipfile.lock)
#+begin_example
$ pipenv install
#+end_example

**** Execute python program

***** When in virtual env shell
#+begin_example
(venv) $ python main.py
#+end_example

***** When not in virtual env shell
#+begin_example
$ pipenv run python main.py
#+end_example

* Magit

Some configuration:

#+begin_src emacs-lisp
(after! magit
  (setq-default +magit-open-windows-in-direction 'down))
#+end_src

** Magit and Gerrit

Push to gerrit:
#+begin_example
p r "origin" RET "HEAD:refs/drafts/master"
p r "origin" RET "HEAD:refs/for/master"
#+end_example

** Blame

#+begin_example
M-x magit-blame-addition (SPC g B)
#+end_example

Press =q= to quit from the blame view.

** Blamer

Ref: [[https://github.com/Artawower/blamer.el][Github: blamer.el]]

To show git blame info for current line. This is another package
not from magit, and not included in doom yet.

#+begin_src emacs-lisp :tangle packages.el
(package! blamer
  :recipe (:host github
           :repo "artawower/blamer.el"))
#+end_src

#+begin_src emacs-lisp
(use-package! blamer
  :custom
  (blamer-idle-time 2.0)
  (blamer-min-offset 70)
  (blamer-max-commit-message-length 70)
  (blamer-author-formatter "%s ")
  (blamer-datetime-formatter nil)        ; no need to show time
  :config
  (setq blamer-type 'both)
  (global-blamer-mode 1))
#+end_src

References:
- [[https://www.lvguowei.me/post/magit-rebase/][Guowei Lv: Magit Tutorial - Rebase (Part I)]]
- [[https://www.lvguowei.me/post/magit-rebase-2/][Guowei Lv: Magit Tutorial - Rebase (Part II)]]

* Project Management

** project.el

*** Overriding the project.el project directory

Ref: [[https://michael.stapelberg.ch/posts/2021-04-02-emacs-project-override/][Emacs: overriding the project.el project directory]].

#+begin_src emacs-lisp
(defun ttk-project-override (dir)
  (let ((override (locate-dominating-file dir ".project.el")))
    (if override
      (cons 'vc override)
      nil)))

(after! project
  (add-hook 'project-find-functions #'ttk-project-override))
#+end_src

Now, we can use touch .project.el in any directory to make
=.project.el= recognize the directory as project root!

** Projectile

