config.el
  (setq-default +magit-open-windows-in-direction 'down))

(use-package! blamer
  :custom
  (blamer-idle-time 2.0)
  (blamer-min-offset 70)
  (blamer-max-commit-message-length 70)
  (blamer-author-formatter "%s ")
  (blamer-datetime-formatter nil)        ; no need to show time
  :config
  (setq blamer-type 'both)
  (global-blamer-mode 1))

(defun ttk-project-override (dir)
  (let ((override (locate-dominating-file dir ".project.el")))
    (if override
      (cons 'vc override)
      nil)))

(after! project
  (add-hook 'project-find-functions #'ttk-project-override))
