doom.org
** =plantuml-mode=

See [[https://github.com/skuro/plantuml-mode][skuro/plantuml-mode]]. To display plantuml.jar version:

#+begin_example
$ java -jar plantuml.jar -version
PlantUML version 1.2021.01 (Tue Feb 02 15:55:08 SGT 2021)
(GPL source distribution)
Java Runtime: OpenJDK Runtime Environment
JVM: OpenJDK 64-Bit Server VM
Default Encoding: UTF-8
Language: en
Country: US

PLANTUML_LIMIT_SIZE: 4096

Dot version: dot - graphviz version 2.43.0 (0)
Installation seems OK. File generation OK
#+end_example

#+begin_src emacs-lisp
;; see doom-emacs/modules/lang/plantuml/packages.el
(use-package! plantuml-mode
  :init
  (setq plantuml-jar-path (format "%s/plantuml/plantuml-1.2023.1.jar" (getenv "DOOMDIR"))
        org-plantuml-jar-path (format "%s/plantuml/plantuml-1.2023.1.jar" (getenv "DOOMDIR"))
        plantuml-indent-level 3
        ;; See: https://github.com/skuro/plantuml-mode/issues/46
        ;; we can save *PLANTUML Preview* buffer to a file with command:
        ;; - C-c C-c  (Turning the display mode to text)
        ;; - SPC f s  (M-x save-buffer)
        ;; - Keyin filename
        ;; Supported format: "svg", "png", "txt" (ascii art)
        plantuml-output-type "svg")
  :config
  (setq plantuml-default-exec-mode 'jar))
  ;; enable plantuml-mode for PlantUML files
  (setq auto-mode-alist (cons '("\\.plantuml$"     . plantuml-mode) auto-mode-alist))
  (setq auto-mode-alist (cons '("\\.[uU][mM][lL]$" . plantuml-mode) auto-mode-alist))
#+end_src

** If you'd like to edit =dot file= directly

See: [[https://github.com/ppareit/graphviz-dot-mode][ppareit/graphviz-dot-mode]].

#+begin_src emacs-lisp :tangle packages.el
(package! graphviz-dot-mode)
#+end_src

#+begin_src emacs-lisp
(use-package! graphviz-dot-mode)
#+end_src

* Treemacs

Enabled via doom module =:ui treemacs=.

By default, it's width is locked. To toggle, press =tw=.

#+begin_src emacs-lisp
(after! treemacs
  (setq treemacs-width 20
        ;; switch to treemacs with keyboard: https://github.com/doomemacs/doomemacs/issues/1177
        treemacs-is-never-other-window nil)
  ;; enable follow mode
  (treemacs-follow-mode t))
#+end_src

** treemacs-projectile

Ref: [[https://ruivieira.dev/doom-emacs.html][ruivieira:DOOM Emacs]].

To guarantee that when moving to a buffer of a different =projectile= project,
the =treemacs= tree will reflect that.

#+begin_src emacs-lisp
(after! treemacs-projectile
  (treemacs-project-follow-mode t))
#+end_src

** =lsp-treemacs=

Integrated by =:ui (treemacs +lsp)=.

Ref: https://github.com/emacs-lsp/lsp-treemacs

Calltree is nice!

#+begin_src emacs-lisp
(after! lsp-treemacs
  (setq lsp-treemacs-theme "Iconless")  ; no need icon, confusing
  ;; (setq lsp-treemacs-theme "Eclipse")
  (lsp-treemacs-sync-mode 1))
#+end_src

* Language Server Protocol
** LSP

The world is moving towards [[https://langserver.org/][Language Server Protocol]], so are we.

- For Doom LSP: see: [[https://github.com/hlissner/doom-emacs/tree/develop/modules/tools/lsp#table-of-contents][Doom LSP]].
- For CC +lsp, see: [[https://github.com/hlissner/doom-emacs/tree/develop/modules/lang/cc#lsp-servers][LSP servers]].
- For python +lsp, see: [[https://github.com/hlissner/doom-emacs/tree/develop/modules/lang/python#language-server-protocol-support][LSP Support]].
- See [[https://www.cheng92.com/emacs/doom-emacs-with-org/][this one]] as well.
- Please see [[https://emacs-lsp.github.io/lsp-mode/page/settings/mode/][emacs-lsp/lsp-mode settings]].
- Robert Krahn: [[https://robert.kra.hn/posts/2021-02-07_rust-with-emacs/#lsp-mode-and-lsp-ui-mode][Configuring Emacs for Rust Development]].
- TODO: see how [[https://github.com/xevrem/customacs][lsp and which-key integration]] works.

