config.el

;; see doom-emacs/modules/lang/plantuml/packages.el
(use-package! plantuml-mode
  :init
  (setq plantuml-jar-path (format "%s/plantuml/plantuml-1.2022.4.jar" (getenv "DOOMDIR"))
        org-plantuml-jar-path (format "%s/plantuml/plantuml-1.2022.4.jar" (getenv "DOOMDIR"))
        plantuml-indent-level 3
        ;; See: https://github.com/skuro/plantuml-mode/issues/46
        ;; we can save *PLANTUML Preview* buffer to a file with command:
        ;; - C-c C-c  (Turning the display mode to text)
        ;; - SPC f s  (M-x save-buffer)
        ;; - Keyin filename
        ;; Supported format: "svg", "png", "txt" (ascii art)
        plantuml-output-type "svg")
  :config
  (setq plantuml-default-exec-mode 'jar))
  ;; enable plantuml-mode for PlantUML files
  (setq auto-mode-alist (cons '("\\.plantuml$"     . plantuml-mode) auto-mode-alist))
  (setq auto-mode-alist (cons '("\\.[uU][mM][lL]$" . plantuml-mode) auto-mode-alist))

(use-package! graphviz-dot-mode)

(after! treemacs
  (setq treemacs-width 20))

(after! treemacs-projectile
  (treemacs-project-follow-mode 1))

(after! lsp-treemacs
  (setq lsp-treemacs-theme "Iconless")  ; no need icon, confusing
  ;; (setq lsp-treemacs-theme "Eclipse")
  (lsp-treemacs-sync-mode 1))

(use-package! lsp
  :init
  ;;
