config.el
  ;; For general LSP, you need :tools lsp
  ;;
  (setq ;;;;;;;;;;;;; Features/Core ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; lsp-auto-configure t            ; default: t
        ;; lsp-eldoc-hook nil              ; default: '(lsp-hover)
        ;; lsp-eldoc-enable-hover t        ; detault: t
        lsp-eldoc-enable-hover nil         ; default: t (too noisy, so do on demand with lsp-ui-doc-show)
        lsp-eldoc-render-all t             ; default: nil. This to show enum value
        lsp-enable-on-type-formatting t    ; default: t
        lsp-enable-symbol-highlighting nil ; default: t
        ;; http://blog.binchen.org/posts/how-to-speed-up-lsp-mode/
        lsp-log-io nil                     ; enable log only for debug
        lsp-enable-folding nil             ; use evil-matchit' instead
        ;; lsp-enable-links nil            ; use ffip instead
        lsp-idle-delay 5.0                 ; default: 0.5
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;; Features/Completion ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-completion-enable t            ; see how is performance
        ;lsp-completion-provider :ivy       ; long live ivy
        ;; lsp-completion-show-detail nil         ; completion item detail
        ;; lsp-completion-show-kind nil           ; completion item kind
        lsp-enable-snippet nil             ; handle yasnippet by myself
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;; Features/Diagnostics ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-diagnostics-provider :none
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;; Features/Headerline ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-headerline-breadcrumb-enable nil               ; headerline
        lsp-headerline-breadcrumb-enable-diagnostics nil
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;; Features/Modeline ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-modeline-workspace-status-enable nil
        lsp-modeline-code-actions-enable nil     ; modeline code actions
        lsp-modeline-diagnostics-enable nil      ; modeline diagnostics statistics
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;; Features/Lens ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-lens-enable nil             ; default: nil
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;; Features/Icons ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-headerline-breadcrumb-icons-enable nil
        ;;
        ;; well, how to make below works?
        ;;
        lsp-prefer-flymake nil          ; prefer lsp-ui (flycheck) over flymake
        ;;
        ;; lsp-navigation 'simple
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;;;;;;;;;;;;;; Extensions/UI ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; see https://emacs-lsp.github.io/lsp-mode/tutorials/how-to-turn-off/
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        lsp-ui-doc-enable nil
        lsp-ui-sideline-enable nil
        lsp-ui-sideline-show-symbol nil
        lsp-ui-sideline-show-diagnostics nil
        lsp-ui-sideline-show-hover nil
        lsp-ui-sideline-show-code-actions nil
        lsp-ui-sideline-update-mode nil
        lsp-ui-peek-enable nil
        lsp-ui-peek-show-directory nil
        lsp-ui-flycheck-enable nil
        lsp-ui-flycheck-live-reporting nil
        lsp-ui-imenu-enable nil
        lsp-ui-doc-show-with-cursor nil ; cursor hover
        lsp-ui-doc-show-with-mouse nil  ; mouse hover
        lsp-signature-auto-activate nil        ; manually: `lsp-signature-activate'
        lsp-signature-render-documentation nil ; signature help documentation
        ;;
        xref-prompt-for-identifier t  ; prompt if no identifier
   )
  ;;
  ;; For python, you need to add :lang (python +lsp)
  ;;
  (setq python-fill-column 149
        python-formatter 'yapf
        python-format-on-save nil
        python-sort-imports-on-save t
        python-pipenv-activate t
   )
)

(with-eval-after-load 'lsp-mode
 ;; VUC directories
 (dolist (dir '(
            "[/\\\\]\\.repo\\'"
            "[/\\\\]\\.venv\\'"
            "[/\\\\]\\tests\\'"
            "[/\\\\]\\err\\'"
            "[/\\\\]\\lst\\'"
            "[/\\\\]\\opt\\'"
            "[/\\\\]\\out\\'"
            "[/\\\\]\\tmp\\'"
            "[/\\\\]\\.cache\\'" ; clangd index
            "[/\\\\]\\.kwlp\\'"  ; klocwor
            "[/\\\\]\\.kwps\\'"  ; klocwor
            "[/\\\\]\\Application_PTF\\'"
            "[/\\\\]\\User_Config_PTF\\'"
            "[/\\\\]\\TVIP_Ctrl_Files\\'"
            "[/\\\\]\\WindRiver\\'"
            ))
  (push dir lsp-file-watch-ignored-directories)
  )
 ;; well disable first :)
 (setq lsp-enable-file-watchers nil)
)

(defun ttk/xref-display-buffer ()
 "Display the *xref* buffer."
 (interactive)
 (let ((buffer (get-buffer "*xref*")))
   (if buffer
     (pop-to-buffer buffer)
    (error "The *xref* buffer does not exist yet"))))

;; (after! xref
;;  (set-popup-rule! "^*xref*$" :side 'left :size 0.4 :select t :ttl nil))

(map! :after lsp
      :map (c-mode-map c++-mode-map python-mode-map)
      :localleader
      :g "l" nil                        ; firstly, unbind default doom binding
      (:prefix "l"                      ; define our ownd
        :nv "d" #'xref-find-definitions
        ;; :nv "d" #'lsp-ui-peek-find-definitions
        :nv "D" #'lsp-ui-doc-show
        :nv "u" #'xref-pop-marker-stack
        ;; :nv "u" #'lsp-ui-peek-jump-backward
        :nv "c" #'lsp-treemacs-call-hierarchy
        :nv "s" #'lsp-find-references
        ;; :nv "s" #'lsp-ui-peek-find-references
        :nv "S" #'lsp-ui-find-workspace-symbol
        :nv "i" #'lsp-ui-sideline-toggle-symbols-info
        :nv "a" #'lsp-workspace-restart
        :nv "b" #'ttk/xref-display-buffer
        ))

(after! company
