doom.org
* Company

Ref:
- [[https://tychoish.com/post/better-company/][Better Company]]
- [[https://readingworldmagazine.com/emacs/2020-07-27-emacs-company-mode/#article-title][Emacs Company Mode]]

#+begin_src emacs-lisp
(after! company
  ;; Full list of company backends, see:
  ;; https://github.com/company-mode/company-mode/tree/master
 (setq company-backends '(company-capf
                          company-keywords
                          ;; company-semantic   ; i don't use semantic
                          company-files
                          ;; company-etags      ; i use cscope
                          ;; company-elisp      ; no longer needed
                          company-clang
                          ;; company-irony-c-headers
                          ;; company-irony
                          ;; company-jedi
                          company-cmake
                          ;; company-ispell    ; i don't use ispell
                          company-yasnippet))
 (setq company-echo-delay 0
       company-minimum-prefix-length 3
       company-show-numbers t
       company-tooltip-limit 20
       company-dabbrev-downcase nil
       ;; adjust this idle delay so it does not interrupt
       ;; your flow while still allowing you to call it on demand
       company-idle-delay 0.5           ; unit is seconds
       company-require-match nil
   )
 ;; make aborting less annoying
 (add-hook 'evil-normal-state-entry-hook #'company-abort)

;;  ;; using digits to select company-mode candidates
;;  ;; https://oremacs.com/2017/12/27/company-numbers/
;;  ;; add some bindings
;;  (let ((map company-active-map))
;;    (mapc (lambda (x) (define-key map (format "%d" x) 'ora-company-number))
;;    (number-sequence 0 9))
;;    (define-key map " " (lambda ()
;;                          (interactive)
;;                          (company-abort)
;;                          (self-insert-command 1)))
;;    (define-key map (kbd "<return>") nil)
;;    )
;;  ;; actual code
;;  (defun ora-company-number ()
;;   "Forward to `company-complete-number'.
;;
;; Unless the number is potentially part of the candidate.
;; In that case, insert the number."
;;   (interactive)
;;   (let* ((k (this-command-keys))
;;         (re (concat "^" company-prefix k)))
;;     (if (cl-find-if (lambda (s) (string-match re s))
;;                     company-candidates)
;;         (self-insert-command 1)
;;       (company-complete-number
;;       (if (equal k "0")
;;           10
;;         (string-to-number k))))))
;;   ;;
;;   ;; end of using digits to select company-mode candidates
;;   ;;
 )
#+end_src

=company= is great, but it can get in the way when using on =org-mode= buffers. Hence,
disable:

#+begin_src emacs-lisp
(after! org
  ;; But I don't want to see line number in og mode
  (add-hook! 'org-mode-hook #'doom-disable-line-numbers-h)
  ;; disable auto-complete in org-mode buffers
  (remove-hook 'org-mode-hook #'auto-fill-mode)
  ;; disable company too
  (setq company-global-modes '(not org-mode)))
#+end_src

* Spell Checker

Toggle ON for org-mode. Well, it's too noisy. Remove the checker =spell=
from =init.el=.

#+begin_src emacs-lisp :tangle no
(after! spell-fu
 (add-hook 'org-mode-hook
   (lambda ()
     (setq spell-fu-faces-exclude '(org-meta-line org-link org-code))
     (spell-fu-mode))))
#+end_src

Another variation,

#+begin_src emacs-lisp :tangle no
(use-package! spell-fu
  :hook (org-mode . (lambda ()
                      (setq spell-fu-faces-exclude
                            '(org-meta-line org-link org-code))
                      (spell-fu-mode)
                      )))
#+end_src

Globally you can toggle with 'M-x global-spell-fu-mode'. =spell-fu= caches words
in =~/.emacs.d/.local/etc/spell-fu=.

* Calendar and World Clock

** Calendar
Ref:
- [[https://emacsredux.com/blog/2021/06/08/emacs-as-your-calendar/][Emacs as Your Calendar]]
- [[https://emacs.stackexchange.com/questions/8309/change-local-holiday-calendar][StackExchange: Change local holiday calendar]]
- [[https://www.emacswiki.org/emacs/CalendarLocalization][EmacsWiki: Calendar Localization]]
- [[https://thenybble.de/projects/german-emacs-calendar.html][German emacs calendar setup]]

** Localized Holidays
#+begin_src emacs-lisp :tangle no
(setq singapore-holidays '((when (= displayed-year 2021)
                             (append
                              (holiday-fixed 1 1   "New Year's Day")
                              (holiday-fixed 2 12  "SG: Chinese New Year")
                              (holiday-fixed 2 13  "SG: Chinese New Year")
                              (holiday-fixed 4 2   "SG: Good Friday")
                              (holiday-fixed 5 1   "Labour Day")
                              (holiday-fixed 5 13  "SG: Hari Raya Puasa")
                              (holiday-fixed 5 26  "SG: Vesak Day")
                              (holiday-fixed 7 20  "SG: Hari Raya Haji")
                              (holiday-fixed 8 9   "SG: National Day")
                              (holiday-fixed 11 4  "SG: Deepavali")
                              (holiday-fixed 12 25 "Christmas Day")))
                           (when (= displayed-year 2022)
                             (append
                              (holiday-fixed 1 1   "New Year's Day (leave credit)")
                              (holiday-fixed 1 20  "Totok AL")
                              (holiday-fixed 1 27  "Totok AL")
                              (holiday-fixed 1 28  "Totok AL")
                              (holiday-fixed 1 31  "Early Release")
                              (holiday-fixed 2 1   "Chinese New Year")
                              (holiday-fixed 2 2   "Chinese New Year")
                              (holiday-fixed 4 15  "Good Friday")
                              (holiday-fixed 5 1   "Labour Day")
                              (holiday-fixed 5 2   "Holiday in lieu")
                              (holiday-fixed 5 3   "Hari Raya Puasa")
                              (holiday-fixed 5 15  "Vesak Day")
                              (holiday-fixed 5 16  "Holiday in lieu")
                              (holiday-fixed 7 10  "Hari Raya Haji")
                              (holiday-fixed 7 11  "Holiday in lieu")
                              (holiday-fixed 8 9   "National Day")
                              (holiday-fixed 10 24 "Deepavali")
                              (holiday-fixed 12 25 "Christmas Day")
                              (holiday-fixed 12 26 "Christmas Day"))))
      south-korea-holidays '((when (= displayed-year 2021)
                               (append
                                 (holiday-fixed 1 1   "New Year's Day")
                                 (holiday-fixed 2 11  "SK: Korean New Year")
                                 (holiday-fixed 2 12  "SK: Korean New Year")
                                 (holiday-fixed 2 13  "SK: Korean New Year")
                                 (holiday-fixed 2 14  "SK: Korean New Year")
                                 (holiday-fixed 3 1   "SK: March 1st Movement")
                                 (holiday-fixed 5 1   "Labour Day")
                                 (holiday-fixed 5 5   "SK: Children's Day")
                                 (holiday-fixed 5 19  "SK: Buddha's Birthday")
                                 (holiday-fixed 6 6   "SK: Memorial Day")
                                 (holiday-fixed 7 17  "SK: Constitution Day")
                                 (holiday-fixed 8 15  "SK: Liberation Day")
                                 (holiday-fixed 9 20  "SK: Harvest Festival")
                                 (holiday-fixed 9 21  "SK: Harvest Festival")
                                 (holiday-fixed 9 22  "SK: Harvest Festival")
                                 (holiday-fixed 10 3  "SK: National Foundation Day")
                                 (holiday-fixed 10 9  "SK: Hangeul Day")
                                 (holiday-fixed 12 25 "Chrstmas Day"))))
      ;; calendar-holidays (append singapore-holidays south-korea-holidays)
      calendar-holidays (append singapore-holidays)
      calendar-mark-holidays-flag t     ; mark dates of holidays
      calendar-week-start-day 1         ; week start on monday
  )
(add-hook 'calendar-today-visible-hook 'calendar-mark-today)    ; mark today's date
#+end_src

** World Clock

List of world clock to show for M-x world-clock. Refer [[https://en.wikipedia.org/wiki/List_of_tz_database_time_zones][this timezone]] for the valid TZNAME.

#+begin_src emacs-lisp
(setq world-clock-list
      '( ;  TZNAME            LABEL
        ("America/Chicago" "Deer Park")
        ("Etc/UTC"         "UTC")
        ("Asia/Kolkata"    "Bangalore")
        ("Asia/Singapore"  "Singapore")
        ("Asia/Chongqing"  "Chongqing")
        ("Asia/Tokyo"      "Tokyo")
        ("Asia/Seoul"      "Seoul")
        ))
;; Format of the display
(setq world-clock-time-format "%a %d-%b-%Y %p %I:%M %Z") ; default: "%A %d %B %R %Z"
#+end_src

* Other Modes
