config.el
 (setq company-backends '(company-capf
                          company-keywords
                          company-semantic
                          company-files
                          company-etags
                          company-elisp
                          company-clang
                          ;; company-irony-c-headers
                          ;; company-irony
                          ;; company-jedi
                          company-cmake
                          company-ispell
                          company-yasnippet))
 (setq company-echo-delay 0
       company-minimum-prefix-length 3
       company-show-numbers t
       company-tooltip-limit 20
       company-dabbrev-downcase nil
       ;; adjust this idle delay so it does not interrupt
       ;; your flow while still allowing you to call it on demand
       company-idle-delay 0.5           ; unit is seconds
       company-require-match nil
   )
 ;; make aborting less annoying
 (add-hook 'evil-normal-state-entry-hook #'company-abort)

;;  ;; using digits to select company-mode candidates
;;  ;; https://oremacs.com/2017/12/27/company-numbers/
;;  ;; add some bindings
;;  (let ((map company-active-map))
;;    (mapc (lambda (x) (define-key map (format "%d" x) 'ora-company-number))
;;    (number-sequence 0 9))
;;    (define-key map " " (lambda ()
;;                          (interactive)
;;                          (company-abort)
;;                          (self-insert-command 1)))
;;    (define-key map (kbd "<return>") nil)
;;    )
;;  ;; actual code
;;  (defun ora-company-number ()
;;   "Forward to `company-complete-number'.
;;
;; Unless the number is potentially part of the candidate.
;; In that case, insert the number."
;;   (interactive)
;;   (let* ((k (this-command-keys))
;;         (re (concat "^" company-prefix k)))
;;     (if (cl-find-if (lambda (s) (string-match re s))
;;                     company-candidates)
;;         (self-insert-command 1)
;;       (company-complete-number
;;       (if (equal k "0")
;;           10
;;         (string-to-number k))))))
;;   ;;
;;   ;; end of using digits to select company-mode candidates
;;   ;;
 )

(after! org
  ;; But I don't want to see line number in og mode
  (add-hook! 'org-mode-hook #'doom-disable-line-numbers-h)
  ;; disable auto-complete in org-mode buffers
  (remove-hook 'org-mode-hook #'auto-fill-mode)
  ;; disable company too
  (setq company-global-modes '(not org-mode)))

(setq singapore-holidays '((when (= displayed-year 2021)
                             (append
                              (holiday-fixed 1 1   "New Year's Day")
                              (holiday-fixed 2 12  "SG: Chinese New Year")
                              (holiday-fixed 2 13  "SG: Chinese New Year")
                              (holiday-fixed 4 2   "SG: Good Friday")
                              (holiday-fixed 5 1   "Labour Day")
                              (holiday-fixed 5 13  "SG: Hari Raya Puasa")
                              (holiday-fixed 5 26  "SG: Vesak Day")
                              (holiday-fixed 7 20  "SG: Hari Raya Haji")
                              (holiday-fixed 8 9   "SG: National Day")
                              (holiday-fixed 11 4  "SG: Deepavali")
                              (holiday-fixed 12 25 "Christmas Day")))
                           (when (= displayed-year 2022)
                             (append
                              (holiday-fixed 1 1   "New Year's Day (leave credit)")
                              (holiday-fixed 1 20  "Totok AL")
                              (holiday-fixed 1 27  "Totok AL")
                              (holiday-fixed 1 28  "Totok AL")
                              (holiday-fixed 1 31  "Early Release")
                              (holiday-fixed 2 1   "Chinese New Year")
                              (holiday-fixed 2 2   "Chinese New Year")
                              (holiday-fixed 4 15  "Good Friday")
                              (holiday-fixed 5 1   "Labour Day")
                              (holiday-fixed 5 2   "Holiday in lieu")
                              (holiday-fixed 5 3   "Hari Raya Puasa")
                              (holiday-fixed 5 15  "Vesak Day")
                              (holiday-fixed 5 16  "Holiday in lieu")
                              (holiday-fixed 7 10  "Hari Raya Haji")
                              (holiday-fixed 7 11  "Holiday in lieu")
                              (holiday-fixed 8 9   "National Day")
                              (holiday-fixed 10 24 "Deepavali")
                              (holiday-fixed 12 25 "Christmas Day")
                              (holiday-fixed 12 26 "Christmas Day"))))
      south-korea-holidays '((when (= displayed-year 2021)
                               (append
                                 (holiday-fixed 1 1   "New Year's Day")
                                 (holiday-fixed 2 11  "SK: Korean New Year")
                                 (holiday-fixed 2 12  "SK: Korean New Year")
                                 (holiday-fixed 2 13  "SK: Korean New Year")
                                 (holiday-fixed 2 14  "SK: Korean New Year")
                                 (holiday-fixed 3 1   "SK: March 1st Movement")
                                 (holiday-fixed 5 1   "Labour Day")
                                 (holiday-fixed 5 5   "SK: Children's Day")
                                 (holiday-fixed 5 19  "SK: Buddha's Birthday")
                                 (holiday-fixed 6 6   "SK: Memorial Day")
                                 (holiday-fixed 7 17  "SK: Constitution Day")
                                 (holiday-fixed 8 15  "SK: Liberation Day")
                                 (holiday-fixed 9 20  "SK: Harvest Festival")
                                 (holiday-fixed 9 21  "SK: Harvest Festival")
                                 (holiday-fixed 9 22  "SK: Harvest Festival")
                                 (holiday-fixed 10 3  "SK: National Foundation Day")
                                 (holiday-fixed 10 9  "SK: Hangeul Day")
                                 (holiday-fixed 12 25 "Chrstmas Day"))))
      ;; calendar-holidays (append singapore-holidays south-korea-holidays)
      calendar-holidays (append singapore-holidays)
      calendar-mark-holidays-flag t     ; mark dates of holidays
      calendar-week-start-day 1         ; week start on monday
  )
(add-hook 'calendar-today-visible-hook 'calendar-mark-today)    ; mark today's date

(when (featurep! :lang json)
  (setq auto-mode-alist (cons '("\\.[jJ][sS][oO][nN]$" . json-mode) auto-mode-alist)))

(when (featurep! :lang cc)
  (setq auto-mode-alist (cons '("^[Cc][Mm][Aa][Kk][Ee][Ll][Ii][Ss][Tt][Ss].[Tt][Xx][Tt]$" . cmake-mode) auto-mode-alist)))

(when (featurep! :tools docker)
  (setq auto-mode-alist (cons '("Dockerfile\\$" . dockerfile-mode) auto-mode-alist)))
