doom.org
** QML (QT Declarative)
Note: This is not needed anymore. Available in Doom =:lang qt=.

Fork from [[https://github.com/coldnew/qml-mode][coldnew/qml-mode]].
#+begin_src emacs-lisp :tangle no
(package! qml-mode
 :recipe (:local-repo "ttk-qml"         ; look for ${DOOMDIR}/ttk-qml/qml-mode.el
 ))
#+end_src
#+begin_src emacs-lisp :tangle no
(use-package! qml-mode
  :init
  :config
  )
;; enable qml-mode for qml files
;(setq auto-mode-alist (cons '("\\.[qQ][mM][lL]$" . qml-mode) auto-mode-alist))
#+end_src

** CSV mode
Note: This is not needed anymore. Available in Doom =:lang data=.

Available on Melpa, ref: https://elpa.gnu.org/packages/csv-mode.html
#+begin_src emacs-lisp :tangle no
(package! csv-mode
 :recipe (:branch "master"
 ))
#+end_src
#+begin_src emacs-lisp :tangle no
(use-package! csv-mode
  :init
  :config
  )
;; enable csv-mode for csv files
;(setq auto-mode-alist (cons '("\\.[Cc][Ss][Vv]$" . csv-mode) auto-mode-alist))
#+end_src

** JSON mode

Available in Doom =:lang json=.

#+begin_src emacs-lisp
(when (modulep! :lang json)
  (setq auto-mode-alist (cons '("\\.[jJ][sS][oO][nN]$" . json-mode) auto-mode-alist)))
#+end_src

** CMake mode

Available in Doom: =:lang cc=

#+begin_src emacs-lisp
(when (modulep! :lang cc)
  (setq auto-mode-alist (cons '("^[Cc][Mm][Aa][Kk][Ee][Ll][Ii][Ss][Tt][Ss].[Tt][Xx][Tt]$" . cmake-mode) auto-mode-alist)))
#+end_src

** Makefile mode

#+begin_src emacs-lisp
(setq auto-mode-alist (cons '("component.def"              .  makefile-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("BuildEnv.opt"               .  makefile-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("makefile_RH850_F1K_1_5MB"   .  makefile-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("windriver_RH850.opt"        .  makefile-mode) auto-mode-alist))
#+end_src

* Tools

** docker

Yeay ... finally docker.

#+begin_src emacs-lisp
(when (modulep! :tools docker)
  (setq auto-mode-alist (cons '("Dockerfile\\$" . dockerfile-mode) auto-mode-alist))
  (setq auto-mode-alist (cons '("dockerfile" . dockerfile-mode) auto-mode-alist)))
#+end_src

** Copy full path of current buffer

Doom already have this with =SPC i F= (Insert current file path). So, disable below.

#+begin_src emacs-lisp :tangle no
;; To get the full path of current buffer and put it in kill-ring
;;
(defun ttk/copy-full-path-to-kill-ring ()
  "copy buffer's full path to kill ring"
  (interactive)
  (when buffer-file-name
    (kill-new (file-truename buffer-file-name))))
#+end_src

** Insert date at cursor

#+begin_src emacs-lisp
;; insert date into buffer
;;
(defun ttk/insert-date ()
 "Insert date at point."
 (interactive)
 (insert (format-time-string "%a %e-%b-%Y %l:%M%p")))
#+end_src

** Show ascii table

Ref: [[https://www.emacswiki.org/emacs/AsciiTable][EmacsWiki: Ascii Table]].

#+begin_src emacs-lisp
(defun ttk/ascii-table()
  "Display basic ASCII table (0 thru 128)."
  (interactive)
  (switch-to-buffer "*ASCII*")
  (erase-buffer)
  (setq buffer-read-only nil)        ;; Not need to edit the content, just read mode (added)
  ;; (local-set-key "q" 'bury-buffer)   ;; Nice to have the option to bury the buffer (added)
  (save-excursion (let ((i -1))
    (insert "ASCII characters 0 thru 127.\n\n")
    (insert " Hex  Dec  Char|  Hex  Dec  Char|  Hex  Dec  Char|  Hex  Dec  Char\n")
    (while (< i 31)
      (insert (format "%4x %4d %4s | %4x %4d %4s | %4x %4d %4s | %4x %4d %4s\n"
                      (setq i (+ 1  i)) i (single-key-description i)
                      (setq i (+ 32 i)) i (single-key-description i)
                      (setq i (+ 32 i)) i (single-key-description i)
                      (setq i (+ 32 i)) i (single-key-description i)))
      (setq i (- i 96))))))
#+end_src

** Arrayify

Ref: [[https://news.ycombinator.com/item?id=22129636][Arrayify]].

Turn strings on newlines into QUOTEd, comma-separated one-liner. Eg:

#+begin_example
josh
sam
jed
C.J.
toby
#+end_example

You select those text, and run "arrayify". You can optionally provide a quote character
to transform to:

#+begin_example
"josh", "jed", "sam", "C.J.", "toby"
#+end_example

#+begin_src emacs-lisp
(defun ttk/arrayify (start end quote)
  "Turn strings on newlines into a QUOTEd, comma-separated one-liner."
  (interactive "r\nMQuote: ")
  (let ((insertion
         (mapconcat
          (lambda (x) (format "%s%s%s" quote x quote))
          (split-string (buffer-substring start end)) ", ")))
    (delete-region start end)
    (insert insertion)))
#+end_src

** dwim-shell-command

Ref: [[https://github.com/xenodium/dwim-shell-command][github.com/xenodium/dwim-shell-command]]

Activate manually by: =M-x dwim-shell-command=.

#+begin_src emacs-lisp :tangle packages.el
(package! dwim-shell-command
  :recipe (:host github
           :repo "xenodium/dwim-shell-command"))
#+end_src

Let's doe some configuration
#+begin_src emacs-lisp
(use-package! dwim-shell-command
  :init
  ;; code here will run immeidately
  :config
  ;; code here will run after the package is loaded
  (defun ttk/dwim-shell-command-convert-svg-to-png ()
    "Convert all marked svg files to png format"
    (interactive)
    (dwim-shell-command-on-marked-files
     "Convert to png"
     "rsvg-convert -b white <<f>> -f png -o <<fne>>.png"
     :utils "rsvg-convert"))
  :bind (([remap shell-command] . dwim-shell-command)
         :map dired-mode-map
         ([remap dired-do-async-shell-command] . dwim-shell-command)
         ([remap dired-do-shell-command] . dwim-shell-command)
         ([remap dired-smart-shell-command] . dwim-shell-command)))
#+end_src

* How To

** Directory Editor with Dired

Tired of dired littering your emacs with dozens of buffers as you
navigate through a directory tree? This solves it:

#+begin_src emacs-lisp
;; For emacs-28.1 and above
(setq dired-kill-when-opening-new-dired-buffer t)
#+end_src

For other =dired= options, refer to [[https://www.masteringemacs.org/article/whats-new-in-emacs-28-1][New in Emacs 28.1]].

Other Ref:

- [[https://www.youtube.com/watch?v=oZSmlAAbmYs][Youtube: Emacs Doom E03 - A short intro to Dired]]
- [[https://www.youtube.com/watch?v=ing9Y53RICs][Youtube: The Nuts and Bolds of Emacs DIRED]]
- =evil-collection=: [[https://github.com/emacs-evil/evil-collection/blob/master/modes/dired/evil-collection-dired.el][keybinding for dired]]
- [[https://ashok-khanna.medium.com/introduction-to-dired-mode-91cecd3a06ff][Ashok: Introduction to Dired Mode]]

Navigational:

- =SPC .= and =<enter>=
- Move cursor down/up: =j=, =k=
- Go subdir down/up: =<enter>=, =-=
- Switch between full view and short view: =(=

Operations:

- Create a directory: =+=
- Create a file: =SPC .= and type in a new filename followed by: =<enter>= will
  automatically open a new file.
- Rename file: =i=, to confirm: =Z Z=, to abort: =Z Q=
- Mark to delete a directory: =d=
  + Execute: =x=
  + Unmark: =u=
- Refresh the Dired buffer: =gr= (=M-x revert-buffer=)

Other operations:

- Sort by name/date: =o=
- Modify file/directory permissions: =M=
- Modify owner: =O=
- Mark file(s): =m=
- Unmark file(s): =u=, unmark all: =U=

Two panes operations:

- Create 2 panes horizontal: =SPC w s=
- Switch between pane: =SPC w w=
- Copy file from current pane to another pane: =C=
- Move file from current pane to antoher pane: =R=

** Expand region

Ref: [[https://github.com/magnars/expand-region.el][magnars/expand-region.el]]
Video: [[http://emacsrocks.com/e09.html][Emacs Rocks! Episode 09: expand-region]]

#+begin_example
M-x er/expand-region
#+end_example

*** Key binding

Good read: [[https://micro.rousette.org.uk/2021/01/03/a-useful-binding.html][A useful binding for expand-region in Emacs]]. Clever keybinding
from Henrik the Devil Lissner himself :)

#+begin_src emacs-lisp
(map! (:map 'override
       :v "v" #'er/expand-region
       :v "V" #'er/contract-region))
#+end_src

In visual mode, hit =v= will expand region, hit =V= will contract region!

** Map Unmap keybinding
Ref:
- [[https://github.com/hlissner/doom-emacs/blob/develop/modules/lang/cc/config.el][doom config.el]]
- [[https://github.com/hlissner/doom-emacs/issues/1797][Unmap keys with prefix]]
- [[https://github.com/hlissner/doom-emacs/issues/820][changing leader key to F13]]
- [[https://github.com/hlissner/doom-emacs/issues/814][howto unmap keymap prefix set via map!]]

** What is my xxx
- Specific keybinding: =<M-x> describe-key (SPC h k)=
- List of keybindings: =SPC ?=
- Specific function: =<M-x> describe-function (SPC h f)=
- Specific variable: =<M-x> describe-variable (SPC h v)=

* References

A lot of manual configuration has been rendered moot by using Emacs Doom,
which aggregates a well-maintained and organized collection of common configuration
settings for performance optimization, package management, commonly used packages
(e.g. Org) and much more.

** General Emacs

- [[https://philjackson.github.io/][Phil Jackson: Snippets and other bits]]
- [[https://blog.sumtypeofway.com/posts/emacs-config.html][Patrick Thomson: Emacs is Agar for Brain Worms]]
- [[https://www.masteringemacs.org/][Mickey Petersen: Mastering Emacs]]
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html][GNU Press: An Introduction to Programming in Emacs Lisp]]
- [[http://yummymelon.com/devnull/][Charles Choi: notes from /dev/null]]

** Doom Emacs

- [[https://tecosaur.github.io/emacs-config/config.html][Tecosaur: Emacs config]]
- [[https://dangirsh.org/projects/doom-config.html][Dan Girshovich: doom-config]]
- [[https://www.gtrun.org/custom/config.html][GuangTao: Doom Emacs config]]
- [[https://cyberchris.xyz/posts/org-mode-assignments/][Chris Tomy: Writing Assignments with Doom Emacs]]
- [[https://hungyi.net/posts/emacs-calculate-while-you-write/][Hung-Yi's Journal: Emacs Lets You Calculate While You Write]]
- [[https://github.com/elken/.doom.d][Elken Doom]]: to be continued.
- [[https://emacstil.com][Junji Zhi: Emacs TIL]]
- [[https://narra.co.za/doom-tips-and-howtos/][Nardus Geldenhuys: Doom Tips and Howto]]: little things make great.
- [[https://hieuphay.com/doom-emacs-config/][Hieu Phay: My Doom Emacs Configuration]]

** Org-mode

- [[https://blog.tecosaur.com/tmio/][This Month in Org]]

** Keybindings
:PROPERTIES:
:CUSTOM_ID: ref-keybindings
:END:
Map reference:
#+begin_example
M-x SPC h f map\!
#+end_example

- [[https://github.com/hlissner/doom-emacs/issues/920#issuecomment-425654279][How to map keybindings for built-in modes]].
- [[https://github.com/hlissner/doom-emacs/issues/1314][How to make package's major mode attaced with leader key map]].
- [[https://github.com/hlissner/doom-emacs/issues/2105][Define keybindings for logview major-mode]].
- [[https://github.com/hlissner/doom-emacs/issues/3246][Change the leader keybinding based on the active mode]].
- [[https://www.reddit.com/r/emacs/comments/irhe5d/doomemacs_binding_functions_to_keystrokes_greater/][Binding functions to keystrokes greater than two]].
- [[https://github.com/hlissner/doom-emacs/issues/1313#issuecomment-480665450][map! macro cause non-prefix error]]
- [[https://rameezkhan.me/adding-keybindings-to-doom-emacs/][Rameez Khan: Adding Keybindings to Doom Emacs]]
- [[https://emacsredux.com/blog/2023/03/12/remove-keybinding-in-emacs/][Emacs Redux: Remove Keybinding in Emacs]]
- [[https://emacsredux.com/blog/2023/03/14/removing-unbinding-vs-unsetting-keybindings/][Emacs Redux: Removing (Unbinding) vs Unsetting Keybindigs]]

** =pipenv=
- [[https://github.com/hlissner/doom-emacs/issues/1666][REQ Automatically activate pipenv if available]]
- [[https://github.com/hlissner/doom-emacs/pull/2806][Enable pipenv-with-projectile]]
- [[https://github.com/hlissner/doom-emacs/pull/3116][Enable projectile integration for pipenv.el]]
- [[https://levelup.gitconnected.com/install-multiple-python-versions-on-windows-10-15a8685ec99d][Install Multiple Python Versions on Windows 10]]
- [[https://levelup.gitconnected.com/how-to-install-and-manage-multiple-python-versions-on-windows-10-c90098d7ba5a][How to install and Manage Multiple Python Versions on Windows 10]]

** Latex and Tikz

This is awesome [[https://latexdraw.com/][TikZBlog]].

Ref:

- [[https://atc1.aut.uah.es/~david/notes/2017/03/datastructures-in-tikz/][Data Structures in Tikz]]
- [[https://www.baeldung.com/cs/latex-drawing-graphs][Draw a Graph Using LaTeX]]
- [[https://jindongpu.wordpress.com/2013/09/25/use-tikz-package-to-draw-automata-in-latex/][Use Tikz package to draw automana in LaTeX]]
- [[https://latexdraw.com/block-diagram-in-latex-step-by-step-tikz-tutorial/][Block Diagram in LaTeX: Step-by-Step Tikz Tutorial]]

** Everything Else

Ref:

- [[https://monkey.org/~marius/unix-tools-hints.html][Hints for Writing Unix Tools]]
- [[https://www.youtube.com/watch?v=ZWQPBoxbqw4][Youtube: Tips and Secrets to Shell Efficienty]]
- [[https://skybert.net/mac-os-x/macos-as-unix-workstation-2022/][macOS as Unix Workstation 2022]]

* Practice
** Delete n lines including current line

*** With avy
#+begin_example
d        (delete)
g s l    (avy-goto-line)
#+end_example

*** With evilmotion
#+begin_example
d        (delete)
5 j      (5 down the line)
#+end_example

** Delete n block of chars

*** With avy
#+begin_example
d            (delete)
g s s        (evil-avy-goto-char-2)
    or
g s <SPACE>  (evil-avy-goto-char-timer)
#+end_example

*** With evil-snipe
#+begin_example
d            (delete)
s 2chars     (evil snipe)
#+end_example

** (Un)commenting

Ref: [[https://medium.com/@aria_39488/the-niceties-of-evil-in-doom-emacs-cabb46a9446b][The Niceties of Evil in Doom Emacs]].

