packages.el

(package! dwim-shell-command
  :recipe (:host github
           :repo "xenodium/dwim-shell-command"))
