doom.org
*** Select comment
#+begin_example
vac   (visual around comment)
#+end_example

** Evil-multiedit
Ref: [[https://www.youtube.com/watch?v=zXdT5jY_ui0&t=112s][Emacs Doom E08: Multiple cursor with evil-multiedit]].

Basic usage:
#+begin_example
- Select a region  (visual selection)
- M-d              (find occurance downwards)
- M-D              (find occurance upwards)
- C-n              (go to next occurance)
- C-p              (go to previous occurance)
- Enter            (to exclude current occurance)
- d e              (edge case: delete last word in occurance)
#+end_example

#+begin_example
One morning, when Gregor Samsa woke from troubled dreams, he found himself
transformed in his bed into a horrible vermin. He lay on this armour-like back,
and if he lifted his head a little he could see his bbrown belly, slightly domed
and divided by arches into stiff sections. The bedding was hardly able to cover
it and seemed ready to slide off any moment.

One morning, when  Samsa woke from troubled dreams, he found himself
transformed in his bed into a horrible vermin. He lay on this armour-like back,
and if he lifted his head a little he could see his bbrown belly, slightly domed
and divided by arches into stiff sections. The bedding was hardly able to cover
it and seemed ready to slide off any moment.

One morning, when  Samsa woke from troubled dreams, he found himself
transformed in his bed into a horrible vermin. He lay on this armour-like back,
and if he lifted his head a little he could see his bbrown belly, slightly domed
and divided by arches into stiff sections. The bedding was hardly able to cover
it and seemed ready to slide off any moment.
#+end_example

** Narrowing
Ref: [[https://www.youtube.com/watch?v=4bVMXXxPiQs][Youtube: Narrowing]]

#+begin_example
- Select region of lines                 (visual line)
- M-x doom/narrow-buffer-indirectly
- Do something, e.g. evil-multiedit
- M-x doom/widen-indirectly-narrowed-buffer  (Bound to: z N)
#+end_example

** Copy and comment lines
#+begin_example
M-x evilnc-copy-and-comment-lines
#+end_example

** Search with ripgrep

*** Live project search from the project root using ripgrep
#+begin_example
M-x +default/search-project  ( SPC / ) ( SPC s p )
#+end_example

*** Grep for a string in the current directory using ripgrep
#+begin_example
M-x counsel-rg
#+end_example

*** Search the current project with ripgrep
#+begin_example
M-x counsel-projectile-rg
#+end_example

** Break a long line into shorther lines

#+begin_example
M-x ruler-mode        (show ruler)
M-x set-fill-column   (set max chars per line used to 'fill' command)
M-x fill-paragraph    (break a long line into shorter lines)
#+end_example

** Calculator

Reading:
- [[https://truongnghiem.wordpress.com/common-calculations-in-emacscalc/][Common Calculations in Emacs Calc]].
- [[https://florian.adamsky.it/2016/03/31/emacs-calc-for-programmers-and-cs.html][Emacs Calc for Programmers and Computer Scientists]].
- [[https://hungyi.net/posts/emacs-calculate-while-you-write/][Emacs Lets You Calculate While You Write]].
- [[https://nullprogram.com/blog/2009/06/23/][The Emacs Calculator]]
- [[https://www.emacswiki.org/emacs/Calc_Tutorials_by_Andrew_Hyatt][Calc Tutorials by Andrew Hyatt]]
- [[https://pagefault.se/post/emacs-can-do-that/][Convert hours, mins and seconds]]
- [[https://github.com/Jesse-Millwood/calc-prog-utils][Calc Prog: a small extension to the Emacs Calc package]]

*** Keybinding

Doom Emacs uses [[https://github.com/emacs-evil/evil-collection][evil-collection]] which remaps some of the keys in
calc mode to be more aligned with evil mode.

Most common operations in Doom Emacs are mapped to the =SPC= leader,
so pressing =C-x= felt foreign to me. So,

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("=" . "calc")
       "=" #'calc-dispatch
       ;; some other shorcuts
       "c" #'calc                ; launch calc mode w/o doing anything clever
       "q" #'quick-calc          ; quick calculations in the minibuffer
       "g" #'calc-grab-region    ; grab a region w/o going through calc-dispatch
       "p" #'calc-copy-to-buffer ; same as SPC u p P
       ))
#+end_src

|-------------------------+------------|
| Function                | Keybinding |
|-------------------------+------------|
| M-x calc-dispatch       | SPC = =    |
| M-x calc                | SPC = c    |
| M-x quick-calc          | SPC = q    |
| M-x calc-grab-region    | SPC = g    |
| M-x calc-copy-to-buffer | SPC = p    |
| M-x calc-unpack         | v u        |
| M-x calc-copy-to-buffer | SPC u p P  |
|-------------------------+------------|

*** Trail Commands

Ref: [[https://www.gnu.org/software/emacs/manual/html_node/calc/Trail-Commands.html][Emacs Trail Commands]]

#+begin_example
M-x calc-trail-display, bound to t d
M-x calc-trail-in,      bound to t i
M-x calc-trail-out,     bound to t o
#+end_example

*** Digit Grouping

Display thousands in decimal, or tuple in binary.

#+begin_example
M-x calc-group-digits <enter>, bound to D g
#+end_example

*** Calc-Mode Epiphany

Ref: [[https://www.youtube.com/watch?v=D9lmCbLGZ_c][Youtube Demonstration]].
#+begin_example
<Place cursor at the location for calc result>
M-x calc            (calc mode)
<Do calculcation>
C-x * y             (copy last item in calc into cursor location)
#+end_example
#+begin_example
# 2:18:47
Convert 2:18:47 into seconds = 8327
#+end_example

*** Convert Decimal/Hexadecimal/Binary

#+begin_example
M-x calc
Type any number.
Type "d6" to turn the display into hex form
Type "d0" to turn the display into dec form
Type "d2" to turn the display into binary form
#+end_example

To display radix generally, use "d r" (calc-radix) and enter
an integer from 2 to 36 (2:binary, 8:octal, 6:hex, 0:dec, etc).

About inputting a number:
- A number entered without "#" is always interpreted as decimal.
- To enter a number with different radix, type "initial digit" then "#"
  |---------------+-------------|
  | initial digit | radix       |
  |---------------+-------------|
  |             2 | binary      |
  |            16 | hexadecimal |
  |             8 | octal       |
  |             0 | decimal     |
  |---------------+-------------|
- To enter a number as current radix, type "#".

*** Binary Number Operation

|------------+----------------------+------------------------------|
| Keybinding | Calc Function        | Description                  |
|------------+----------------------+------------------------------|
| b a        | (calc-and)           | Bitwise AND                  |
| b o        | (calc-or)            | Bitwise OR                   |
| b x        | (calc-xor)           | Bitwise XOR                  |
| b n        | (calc-not)           | Bitwise NOT                  |
| b d        | (calc-diff)          | Bitwise difference           |
| b r        | (calc-rshift-binary) | Bitwise right shift by 1 bit |
| b l        | (calc-lshift-binary) | Bitwise left shift by 1 bit  |
|------------+----------------------+------------------------------|

**** Bitwise shift by more than 1 bit

- Use /numeric prefix argument/. Example: To shift 9 bits to the left:
  #+begin_example
  1 <RET>
  C-9 b l
  #+end_example
- Use =H b l=. It requires 2 arguments from the stack: the value to shift,
  and, at the top-of-stack, the number of bits to shift:
  #+begin_example
  1 <RET>
  9 <RET>
  H b l
  #+end_example

*** HMS
**** Convert Minute to HH:MM:SS
1. Convert 8000 min to hour
   : 8000 RET 60 RET /
   133.333333333
2. Convert the hour to HMS
   : M-x calc-to-hms (bound to c h)
   133@ 19' 59.999999"
Result: 6000 secs = 133 hour 19 min 60 sec

**** Convert HH:MM:SS to Minute
1. Enter to algebraic mode
   : '
   : Algebraic: 133hr+19min+60sec
   133 hr + 19 min + 60 sec
2. Convert to base unit
   : M-x calc-base-unit (bound to U b)
   480000 s
3. Convert to minute
   : 60 RET /
   8000 s

** Macros

Automate repetitive tasks by recording and replaying keyboard macros.

- Start keyboard macro: =M-x kmacro-start-macro: C-x (=
- End keyboard macro: =M-x kmacro-end-macro: C-x )=
- End and call macro: =M-x kmacro-end-and-call-macro: C-x e=
- Set counter: =M-x kmacro-set-counter: C-x C-k C-c=
- Insert counter: =M-x kmacro-insert-counter: C-x C-k TAB=

*** Exercise 1

Produce this:
#+begin_example
(xterm-color-names [,col0 ,col1 ,col2 ,col3 ,col4 ,col5 ,col6 ,col7])
#+end_example

*** Exercise 2

Produce this:
#+begin_example
0   http0mailbox
1   http1mailbox
2   http2mailbox
3   http3mailbox
4   http4mailbox
5   http5mailbox
6   http6mailbox
7   http7mailbox
8   http8mailbox
9   http9mailbox
10  http10mailbox
#+end_example
